[
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "caused",
                "correct": "cause",
                "explanation": "This sentence uses \"will\" because it's referring to future events. It is inappropriate to use the past tense \"caused\" for events that have not occurred or might not occur, so it should be changed to \"cause.\" (This is an especially tricky example because the future tense \"will\" is followed directly by \"if not already,\" which references a potential past event. It should be phrased \"This will cause problems in the future, if it has not already, as there is very limited space for us.\")"
            },
            {
                "start": 11,
                "end": 12,
                "error": "are",
                "correct": "is",
                "explanation": "The subject of the verb is \"space,\" which is singular, so for subject-verb agreement, it should be changed to \"is.\""
            },
            {
                "start": 14,
                "end": 15,
                "error": "spaces",
                "correct": "space",
                "explanation": "Space can be treated as either countable or uncountable. As a countable noun, it means area delineated for a specific purpose and it can be made plural. As an uncountable noun, which cannot be made plural, it means an amount of area that is unoccupied. This is the sense of meaning used when talking about \"limited space,\" so it cannot be made plural. "
            }
        ],
        "id": 7,
        "incorrect sentence": "This will , if not already , caused problems as there are very limited spaces for us .",
        "correct sentence": "This will , if not already , cause problems as there is very limited space for us ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 5,
                "error": "obtain",
                "correct": "obtained",
                "explanation": "This sentence is using the passive modal, which requires a form of the verb \"to be\" and the past participle of a verb. In this construction, the verb form must always be the past participle, so \"obtain\" should be changed to \"obtained.\""
            },
            {
                "start": 22,
                "end": 23,
                "error": "in",
                "correct": "of",
                "explanation": "The preposition \"in\" means inside of or surrounded by, so \"the problems in lands that are inhospitable\" means problems that exist in inhospitable lands. The preposition \"of\" indicates ownership, association, or the nature of something, so \"the problem of lands that are inhospitable\" means that the nature of the problem is that the lands are inhospitable. That is the intended meaning here, so \"in\" should be changed to \"of.\""
            },
            {
                "start": 25,
                "end": 25,
                "error": "-",
                "correct": "are",
                "explanation": "The \"are\" in the phrase \"lands that are inhospitable\" is necessary because a form of the verb \"to be\" is needed to link the noun \"lands\" with the adjective \"inhospitable.\""
            },
            {
                "start": 28,
                "end": 29,
                "error": "desserts",
                "correct": "deserts",
                "explanation": "This is a spelling error. The word \"desserts\" refers to sweets, and \"deserts\" refers to barren areas of landscape."
            }
        ],
        "id": 13,
        "incorrect sentence": "The solution can be obtain by using technology to achieve a better usage of space that we have and resolve the problems in lands that inhospitable such as desserts and swamps .",
        "correct sentence": "The solution can be obtained by using technology to achieve a better usage of space that we have and resolve the problems of lands that are inhospitable such as deserts and swamps ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 7,
                "error": "-",
                "correct": "to get",
                "explanation": "The infinitive verb \"to get\" is missing. \"Managing a place to live\" means taking care of a residential property, while \"managing to get a place to live\" means securing housing. This sentence is talking about the problems of overpopulation, so the meaning of securing housing is appropriate, and the infinitive should be added."
            },
            {
                "start": 13,
                "end": 14,
                "error": "citizen",
                "correct": "citizens",
                "explanation": "Countries have more than one citizen, so the plural \"citizens\" should be used here instead of the singular \"citizen.\""
            }
        ],
        "id": 17,
        "incorrect sentence": "Some countries are having difficulties in managing a place to live for their citizen as they tend to get overpopulated .",
        "correct sentence": "Some countries are having difficulties in managing to get a place to live for their citizens as they tend to get overpopulated ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 1,
                "error": "-",
                "correct": "has",
                "explanation": "The present perfect tense is used to describe events that occurred in the past but continue into or affect the present. It requires a form of the auxiliary verb \"to have\" plus the past participle of a verb. The phrase \"this has caused problems\" conveys that past overpopulation has already caused problems (the formation and growth of slums) that still persist today."
            },
            {
                "start": 2,
                "end": 3,
                "error": "problem",
                "correct": "problems",
                "explanation": "The sentence lists two problems, the formation of slums and the growth of slums. Therefore, the plural should be used."
            },
            {
                "start": 5,
                "end": 6,
                "error": "appearance",
                "correct": "formation and growth",
                "explanation": "\"Appearance\" refers to either the way a person/thing looks or the act of performing/participating in a public event. The noun \"appearance\" cannot be used to refer to the process of slums appearing in a city, so it should be changed to \"formation and growth.\""
            },
            {
                "start": 13,
                "end": 14,
                "error": "is",
                "correct": "are",
                "explanation": "The subject of this verb is \"slums,\" which is plural, so the verb \"are\" should be used for subject-verb agreement."
            },
            {
                "start": 16,
                "end": 16,
                "error": "-",
                "correct": "to live in",
                "explanation": "I don't think this correction is strictly necessary. It is grammatically correct and not inaccurate to say that slums \"are not safe due to their unhealthy environment.\""
            },
            {
                "start": 18,
                "end": 19,
                "error": "the",
                "correct": "their",
                "explanation": "The determiner \"their\" is used to convey the relationship between the \"slums\" and the \"unhealthy environment.\" The environment is regarded as an aspect or characteristic of the slum, and this relationship is expressed using possessiveness. The characteristic of being unsafe belongs to the slum, so the possessive determiner \"their\" is used to convey this ownership."
            }
        ],
        "id": 25,
        "incorrect sentence": "This caused problem like the appearance of slums which most of the time is not safe due to the unhealthy environment .",
        "correct sentence": "This has caused problems like the formation and growth of slums which most of the time are not safe to live in due to their unhealthy environment ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 9,
                "error": "of",
                "correct": "for",
                "explanation": "The preposition \"of\" indicates the source of something or a relationship of ownership, so the phrase \"the demands of space\" means demands that are coming from space or that belong to space, which is not logical. The preposition \"for\" can mean in order to get something, so \"the demands for space\" means that someone is demanding space. To convey this meaning, \"of\" should be changed to \"for.\""
            },
            {
                "start": 17,
                "end": 18,
                "error": "the",
                "correct": "-",
                "explanation": "\"Land\" is a general concept that should be familiar to the reader, so it does not take the definite article \"the\" when used in a general sense. \"The\" is used with land only when drawing a distinction or a comparison between different areas of land, and not in a general statement like this."
            },
            {
                "start": 24,
                "end": 25,
                "error": "it",
                "correct": "the same area of land",
                "explanation": "The pronoun \"it\" is used instead of \"land\" but it can easily be mistaken to be referring to \"building\" instead. It should be changed to make the meaning clearer. Also, the phrase \"the same area of land\" in particular emphasizes the author's point about achieving better usage of land, as the same land can now accommodate more people."
            },
            {
                "start": 27,
                "end": 28,
                "error": "more",
                "correct": "a greater",
                "explanation": "Either \"more people\" or \"a greater number of people\" would be acceptable, but they cannot be mixed."
            },
            {
                "start": 31,
                "end": 35,
                "error": "with the same spaces",
                "correct": "-",
                "explanation": "The meaning \"with the same (space)\" is already conveyed by the edit \"the same area of land,\" so it is redundant to restate it."
            }
        ],
        "id": 32,
        "incorrect sentence": "The only way to satisfy the increasing demands of space is by achieving a better usage of the land like designing taller building so it can accommodate more number of people with the same spaces .",
        "correct sentence": "The only way to satisfy the increasing demands for space is by achieving a better usage of land like designing taller building so the same area of land can accommodate a greater number of people ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "create",
                "correct": "use",
                "explanation": "The verb \"create\" means to bring something into existence, so \"to create a material\" means to develop a material that does not exist yet. The intended meaning of this sentence is not to develop a new material but to construct buildings with a better material, so the verb \"use\" should be used instead."
            },
            {
                "start": 6,
                "end": 7,
                "error": "a",
                "correct": "-",
                "explanation": "The indefinite article \"a\" refers to one thing, so the phrase \"create a better material\" to create one material, but this sentence is about material in general. In this case, it is common to say \"create better material,\" in which \"material\" is an uncountable noun meaning matter from which something is made, or \"create better materials,\" in which \"materials\" can refer to various building materials."
            },
            {
                "start": 12,
                "end": 13,
                "error": "the",
                "correct": "-",
                "explanation": "\"Building\" is a general concept that should be familiar to the reader, so it does not take the definite article \"the\" when referred to in a general sense. \"The\" is used with \"buildings\" in order to draw a distinction or a comparison between different buildings, but not in a general statement like this."
            },
            {
                "start": 14,
                "end": 15,
                "error": "despite",
                "correct": "during",
                "explanation": "\"Despite\" means in spite of or not being affected by something. \"During\" means throughout the duration of an event. This sentence isn't referring to materials that can support a building in spite of the occurrence of disasters, but materials that allow a building to withstand disasters by providing support throughout the duration of a disaster. Therefore, \"during\" should be used instead."
            },
            {
                "start": 17,
                "end": 18,
                "error": "disaster",
                "correct": "disasters",
                "explanation": "When referencing natural disasters in general, the plural \"disasters\" should be used because it is a category that refers to earthquakes, typhoons, and multiple other things. The singular \"disaster\" is used to refer to an individual disaster, with \"a disaster\" meaning any disaster and \"the disaster\" meaning one specific disaster."
            }
        ],
        "id": 39,
        "incorrect sentence": "It is also important to create a better material that can support the buildings despite any natural disaster like earthquakes .",
        "correct sentence": "It is also important to use better material that can support buildings during any natural disasters like earthquakes ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 5,
                "error": "-",
                "correct": ",",
                "explanation": "A comma is needed between \"Japan\" and \"where\" to mark the start of a non-essential clause. A non-essential clause is part of a sentence that can be removed without destroying the meaning of the sentence. It provides information about the essential clause. The phrase \"A good example is Japan\" is a complete sentence on its own, and the non-essential clause is \"where there are... there.\" The comma shows where the clause begins, clarifying the meaning of the sentence."
            },
            {
                "start": 20,
                "end": 21,
                "error": "in",
                "correct": "-",
                "explanation": "The phrase \"there\" already implies a location, so it does not use a preposition. Also, the phrase \"in there\" refers to the inside of a tangible object, not a geographical location."
            }
        ],
        "id": 43,
        "incorrect sentence": "A good example is Japan where there are a lot of tall condominiums despite the large number of earthquakes happening in there .",
        "correct sentence": "A good example is Japan , where there are a lot of tall condominiums despite the large number of earthquakes happening there ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "lands",
                "correct": "land",
                "explanation": "In most contexts, the noun \"land\" is used as a collective noun, so \"land\" is both the singular and the plural. "
            },
            {
                "start": 7,
                "end": 8,
                "error": "a",
                "correct": "-",
                "explanation": "The noun \"sanitation\" is uncountable because it refers to a process. It does not take the indefinite article \"a\" because it is uncountable and intangible."
            },
            {
                "start": 19,
                "end": 19,
                "error": "-",
                "correct": "will",
                "explanation": "If a statement is referring to future events, it is inappropriate to use the present tense, which refers to the current state of affairs. To talk about the future, use the future tense, which consists of \"will\" plus the bare infinitive."
            },
            {
                "start": 26,
                "end": 27,
                "error": "heath",
                "correct": "health",
                "explanation": "This is a spelling error. A \"heath\" is a kind of plant or a marshland, while \"health\" refers to a state of wellbeing without illness or injury."
            }
        ],
        "id": 49,
        "incorrect sentence": "Besides a better usage of lands , a better sanitation is also needed because a huge number of people need a clean environment to maintain their heath .",
        "correct sentence": "Besides a better usage of land , better sanitation is also needed because a huge number of people will need a clean environment to maintain their health ."
    },
    {
        "corrections": [
            {
                "start": 20,
                "end": 27,
                "error": "reforms the land to make it livable",
                "correct": "restore the land to a livable state",
                "explanation": "The word \"reform\" is used for man-made things and not for nature. \"Restore,\" meaning to return to a previous state, is a better choice, especially given the context of needing better sanitation. \"To make it livable\" implies that the land was not livable in the past, while \"restore to a livable state\" implies that the conditions that currently make the land unlivable, or the unsanitary state, can be addressed, allowing the land to return to its original, livable state."
            },
            {
                "start": 31,
                "end": 32,
                "error": "it",
                "correct": "-",
                "explanation": "The verb \"help\" can be either transitive or intransitive, and when used as intransitive, it doesn't require an object. Without the pronoun \"it,\" the phrase \"technology can help\" means that technology can contribute or make things easier."
            },
            {
                "start": 40,
                "end": 44,
                "error": "trouble the lands have",
                "correct": "quality of the land",
                "explanation": "The noun \"trouble\" means problems that the land has, and it has a negative connotation. \"Quality\" means attributes or characteristics, and it has a neutral connotation. \"Quality\" expresses that technology can be applied as appropriate for the characteristics of the land, rather than solely to address problems."
            }
        ],
        "id": 55,
        "incorrect sentence": "Countries with a lot of inhospitable space need not only to achieve a better space usage , but also to reforms the land to make it livable and technology can help it in a number of ways depending on the trouble the lands have .",
        "correct sentence": "Countries with a lot of inhospitable space need not only to achieve a better space usage , but also to restore the land to a livable state and technology can help in a number of ways depending on the quality of the land ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 9,
                "error": "deserts",
                "correct": "desert",
                "explanation": "This is a spelling error. The word \"desserts\" refers to sweets, and \"deserts\" refers to barren areas of landscape."
            },
            {
                "start": 10,
                "end": 11,
                "error": "terraform",
                "correct": "transform",
                "explanation": "The verb \"terraform\" means to transform a landscape so as to resemble the Earth, so it is rarely used for earth environments, only other planets."
            },
            {
                "start": 19,
                "end": 20,
                "error": "using",
                "correct": "use",
                "explanation": "This is part of a verb phrase with the auxiliary verb \"can,\" which requires the bare infinitive and not the gerund. Therefore, the gerund \"using\" should be changed to \"use.\""
            }
        ],
        "id": 60,
        "incorrect sentence": "For example , countries with a lot of deserts can terraform their desert to increase their habitable land and using irrigation to provide clean water to the desert .",
        "correct sentence": "For example , countries with a lot of desert can transform their desert to increase their habitable land and use irrigation to provide clean water to the desert ."
    },
    {
        "corrections": [
            {
                "start": 17,
                "end": 17,
                "error": "-",
                "correct": ".",
                "explanation": "I don't agree with this correction. In written English, it is incorrect to start a sentence with \"but.\" The meaning is also clearer as one sentence with the conjunction \"but,\" as in \"...the country (has) almost no natural water, but it uses irrigation...\" "
            },
            {
                "start": 17,
                "end": 18,
                "error": "and",
                "correct": "But",
                "explanation": "I don't agree with this correction. First, the capitalized \"But\" is only used at the start of a sentence, but the meaning is clearer as one sentence. Therefore, I would keep the structure as is, without capitalizing the conjunction. Second, I think either \"and\" or \"but\" can be used here depending on the nuance. \"And\" is used to connect similar concepts or add more information, while \"but\" is used to connect concepts that are different or that contradict expectations. This correction is for style or meaning, not grammar."
            },
            {
                "start": 18,
                "end": 19,
                "error": "they",
                "correct": "it",
                "explanation": "This pronoun needs to refer to Dubai, a country. Countries use the pronoun \"it\" instead of \"they.\""
            },
            {
                "start": 19,
                "end": 20,
                "error": "use",
                "correct": "uses",
                "explanation": "The subject is \"it,\" which is singular, so the verb should be changed to \"uses\" for subject-verb agreement."
            }
        ],
        "id": 66,
        "incorrect sentence": "Dubai will be a good example for this as previously the country got almost no natural water and they use irrigation to bring natural water to the country .",
        "correct sentence": "Dubai will be a good example for this as previously the country got almost no natural water . But it uses irrigation to bring natural water to the country ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "whose",
                "correct": "where",
                "explanation": "The word \"whose\" refers to people, not to countries. For countries, use \"where\" or \"which.\" "
            },
            {
                "start": 8,
                "end": 9,
                "error": "his",
                "correct": "the",
                "explanation": "\"His\" is the singular male possessive pronoun, so it is used to indicate ownership by a single male person. The subject is the Netherlands, and gendered pronouns are not used for countries. Also, the possessive aspect is already conveyed by the edit \"whose,\" so it would be redundant to use another possessive. Therefore the definite article \"the\" should be used instead."
            },
            {
                "start": 9,
                "end": 10,
                "error": "lands",
                "correct": "land",
                "explanation": "In most contexts, the noun \"land\" is used as a collective noun, so \"land\" is both the singular and the plural. "
            },
            {
                "start": 11,
                "end": 12,
                "error": "a",
                "correct": "-",
                "explanation": "The indefinite article \"a\" refers to one thing, so the phrase \"most of the land is a swamp\" means that there is one swamp that covers most of the Netherlands. In reality, most of the land is swampland but the country is not a single swamp, so \"a\" should be removed."
            },
            {
                "start": 16,
                "end": 17,
                "error": ",",
                "correct": ". It",
                "explanation": "To make a new sentence, replace the comma with a period and add a pronoun to replace the subject. The meaning is clearer when the sentence is divided into two. The first sentence cites the Netherlands as another example and introduces one attribute of its land. The second sentence explains how it has used technology to address issues."
            },
            {
                "start": 17,
                "end": 18,
                "error": "have",
                "correct": "has",
                "explanation": "The subject is \"it,\" which is singular, so the verb should be changed to \"has\" for subject-verb agreement."
            }
        ],
        "id": 74,
        "incorrect sentence": "Another example is Netherlands , whose most of his lands is a swamp under sea level , have used a good irrigation system to counter their problem and to make their land habitable .",
        "correct sentence": "Another example is Netherlands , where most of the land is swamp under sea level . It has used a good irrigation system to counter their problem and to make their land habitable ."
    },
    {
        "corrections": [
            {
                "start": 9,
                "end": 10,
                "error": "of",
                "correct": "for",
                "explanation": "The preposition \"of\" refers to attributes or ownership. Therefore, \"need of,\" as in \"he is in need of X,\" means \"lacking in X.\" The preposition \"for\" can mean that something is for a certain cause or purpose. This better expresses the relationship between \"need\" and \"habitable environment,\" so \"of\" should be changed to \"for.\""
            },
            {
                "start": 14,
                "end": 15,
                "error": "essential",
                "correct": "increasing",
                "explanation": "This correction isn't strictly necessary because the sentence is grammatically correct. However, the use of \"increasing\" could be better to emphasize \"As the number of people grows\" because \"grow\" and \"increase\" have similar meanings. "
            }
        ],
        "id": 78,
        "incorrect sentence": "As the number of people grows , the need of habitable environment is unquestionably essential .",
        "correct sentence": "As the number of people grows , the need for habitable environment is unquestionably increasing ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 5,
                "error": "Engineering",
                "correct": "engineering",
                "explanation": "English only capitalizes proper nouns and the first word of a sentence. Because \"engineering\" is a common noun and it appears mid-sentence, it should not be capitalized."
            },
            {
                "start": 12,
                "end": 13,
                "error": "accommodation",
                "correct": "environment",
                "explanation": "\"Accommodation\" means a place to stay. If a place is not habitable, it isn't usually considered accommodation, so the idea of \"more habitable accommodation\" is somewhat contradictory. \"Environment\" is a better choice because it refers to the surroundings overall or the natural world as a whole."
            },
            {
                "start": 15,
                "end": 16,
                "error": "a",
                "correct": "-",
                "explanation": "The indefinite article \"a\" refers to one thing, so the phrase \"create a better material\" to create one material, but this sentence is about material in general. In this case, it is common to say \"create better material,\" in which \"material\" is an uncountable noun meaning matter from which something is made, or \"create better materials,\" in which \"materials\" can refer to various building materials."
            },
            {
                "start": 18,
                "end": 22,
                "error": "so it 's possible",
                "correct": "-",
                "explanation": "This correction isn't strictly necessary because the phrase is grammatically correct, but the edit makes it more concise and easy to understand. Following \"designing stronger material\" with the infinitive \"to build\" means to design stronger material in order to build something, or stronger material that can be used to build something. This conveys the nuance of \"so it's possible\" more concisely and clearly."
            },
            {
                "start": 23,
                "end": 24,
                "error": "create",
                "correct": "build",
                "explanation": "The verb \"create,\" which means to bring something into existence, isn't normally used with buildings. There is no grammatical problem with \"build,\" but the phrase \"build buildings\" sounds redundant, so it's common to say \"construct.\""
            },
            {
                "start": 24,
                "end": 29,
                "error": "a taller and safer building",
                "correct": "taller and safer buildings",
                "explanation": "The indefinite article \"a\" refers to one thing, so the phrase \"a taller and safer building\" means one such building. In reality, one building won't address overcrowding, so the plural \"buildings\" should be used and \"a\" should be deleted."
            },
            {
                "start": 29,
                "end": 30,
                "error": ",",
                "correct": "and",
                "explanation": "[1] This sentence lists two things that can be accomplished with stronger materials: (1) \"to construct taller and safer buildings,\" and (2) \"to create a better and efficient sanitation system.\" (1) and (2) are joined by a comma, but commas can only be used to link items in a list of three items or longer. Therefore, it requires the conjunction \"and.\" "
            },
            {
                "start": 43,
                "end": 48,
                "error": "designing a way to change",
                "correct": "changing",
                "explanation": "The subject of the sentence is \"engineering designs\" and it would be confusing to say \"designs can help... by designing...\". Designs do not design themselves, so it's better to simply say \"designs can help... by changing...\". Also, the indefinite article \"a\" refers to one thing, so \"a way to change\" means formulating one single method. It is assumed that engineers will design multiple ways, so it's better to say \"finding ways to change\" or, very simply, \"changing.\""
            },
            {
                "start": 52,
                "end": 53,
                "error": "inhabitable",
                "correct": "otherwise uninhabitable",
                "explanation": "\"Inhabitable\" means that the land can be lived on. The correct word is \"uninhabitable,\" but alone, it can imply that the land cannot be made habitable. The phrase \"otherwise uninhabitable\" makes it clear that the conditions of the land can be changed, transforming it from uninhabitable to inhabitable."
            }
        ],
        "id": 89,
        "incorrect sentence": "In this era , Engineering designs can help to provide more habitable accommodation by designing a stronger material so it 's possible to create a taller and safer building , a better and efficient sanitation system to prevent disease , and also by designing a way to change the condition of the inhabitable environment .",
        "correct sentence": "In this era , engineering designs can help to provide more habitable environment by designing stronger material to build taller and safer buildings and a better and efficient sanitation system to prevent disease , and also by changing the condition of the otherwise uninhabitable environment ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 3,
                "error": "technologically",
                "correct": "technological",
                "explanation": "\"Technologically\" is an adverb, so it modifies verbs, while \"technological\" is an adjective, so it modifies nouns. The word to be modified here is \"determinists,\" which is a noun, so \"technological\" should be used instead."
            }
        ],
        "id": 97,
        "incorrect sentence": "Besides some technologically determinists that allow the development of biometric identification , this technology is also shaped by three social factors , namely , the desire of the society for safety , convenience and economy .",
        "correct sentence": "Besides some technological determinists that allow the development of biometric identification , this technology is also shaped by three social factors , namely , the desire of the society for safety , convenience and economy ."
    },
    {
        "corrections": [
            {
                "start": 12,
                "end": 13,
                "error": "concern",
                "correct": "are concerned about",
                "explanation": "The verb \"concern\" means to make (someone) anxious or worried, as in \"Global warming concerns me.\" In that sense, in this example, \"safety\" (subject) concerns (verb) \"countries and companies\" (object). However, when you change the object (countries and companies) to the subject, you should also change the structure using the phrase \"(subject) + is concerned about.\" This means that the countries and companies feel anxious because of crucial problems like safety."
            }
        ],
        "id": 100,
        "incorrect sentence": "Safety is one of the crucial problems that many countries and companies concern .",
        "correct sentence": "Safety is one of the crucial problems that many countries and companies are concerned about ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "virus",
                "correct": "viruses",
                "explanation": "The phrase \"more and more\" means increasing (in number), so it is always used with plural nouns. The singular \"virus\" should be changed to the plural \"viruses.\""
            },
            {
                "start": 8,
                "end": 9,
                "error": "hack",
                "correct": "hackers",
                "explanation": "\"Hack\" is a verb, and \"hacking\" is an action. The phrase \"hacking can access personal computers\" doesn't make sense because the action \"hacking\" needs someone to perform it. Therefore, it should be changed to \"hackers,\" meaning people who engage in computer hacking."
            },
            {
                "start": 15,
                "end": 16,
                "error": "the",
                "correct": "-",
                "explanation": "\"Data and documents\" is a general concept that should be familiar to the reader, so it does not take the definite article \"the\" when used in a general sense. \"The\" is used with data only when drawing a distinction or a comparison between different pieces or types of data, and is not used in a general statement like this."
            }
        ],
        "id": 105,
        "incorrect sentence": "On one hand more and more virus and hack can access personal computers , so the secret data and documents may be stolen .",
        "correct sentence": "On one hand more and more viruses and hackers can access personal computers , so secret data and documents may be stolen ."
    },
    {
        "corrections": [
            {
                "start": 10,
                "end": 11,
                "error": "administration",
                "correct": "rules",
                "explanation": "\"Administration\" refers to the process of management or of running an organization. The phrase \"strict administration\" is not commonly used. \"Rules\" is a better choice because it means regulations or principles that govern procedure, and regulations can help to prevent information leaks. "
            },
            {
                "start": 11,
                "end": 12,
                "error": "to",
                "correct": "for",
                "explanation": "\"For\" is used to indicate who is governed by rules. The preposition \"to\" refers to directionality or flow of movement toward something, while \"for\" can be used to indicate the person, thing, or purpose that something is for. \"Rules\" are made for the sake of governing the behavior of staff members, not toward the direction of staff members, so \"for\" is correct."
            },
            {
                "start": 13,
                "end": 14,
                "error": "members",
                "correct": "staff members over the use of confidential information",
                "explanation": "The word \"members\" is not commonly used alone; it's much more common to say staff members, team members, etc. The phrase \"over the use of confidential information\" should be added for clarity. \"Rules\" alone is vague, so this phrase is added to indicate how the rules help to avoid information leaks, namely by governing the use of confidential information."
            }
        ],
        "id": 110,
        "incorrect sentence": "On the other hand , some important departments need strict administration to their members to avoid information leaks .",
        "correct sentence": "On the other hand , some important departments need strict rules for their staff members over the use of confidential information to avoid information leaks ."
    },
    {
        "corrections": [
            {
                "start": 24,
                "end": 25,
                "error": "use",
                "correct": "example",
                "explanation": "To say \"The US DoD is one successful use of biometric identification\" is confusing because it means that the department itself is a \"use,\" which means the action of using something. \"Example,\" on the other hand, means something that illustrates a general rule, and for a general rule to exist in the first place, it needs to have more than one example. Changing \"use\" to \"example\" conveys that the US DoD is one of several or many successful use cases of biometric identification. Also, if it is only one of many successful examples, then the writer's argument becomes even stronger."
            }
        ],
        "id": 113,
        "incorrect sentence": "The United States Department of Defense ( DoD ) { Common Access Card } [ HYPERLINK : http : //en.wikipedia.org/wiki/Common_Access_Card ] is a successful use of biometric identification .",
        "correct sentence": "The United States Department of Defense ( DoD ) { Common Access Card } [ HYPERLINK : http : //en.wikipedia.org/wiki/Common_Access_Card ] is a successful example of biometric identification ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 9,
                "error": "involved",
                "correct": "employed",
                "explanation": "This is a stylistic change because \"involved\" is grammatically correct. \"Employ\" means make use of, often toward a specific purpose. \"Involved\" means to have or include something in a process. This is vague, but \"employ\" describes specifically how biometric identification is involved in security, namely that it is used for a specific purpose."
            },
            {
                "start": 11,
                "end": 12,
                "error": "secure",
                "correct": "security-sensitive",
                "explanation": "I don't agree with this correction. \"Security-sensitive\" is not a commonly used phrase. I would change it to \"high-security,\" or possibly leave it unchanged because \"secure\" is frequently used to mean needing higher security than average."
            },
            {
                "start": 17,
                "end": 18,
                "error": "human",
                "correct": "people",
                "explanation": "There is a difference in nuance between \"humans\" and \"people.\" The word \"human\" is used more narrowly, mostly to refer to the human race as a whole, to distinguish human beings from other species, or to discuss human behavior in a scientific context. In most general, everyday uses, it's much more common to use \"people.\""
            }
        ],
        "id": 119,
        "incorrect sentence": "As we can see , the biometric identification involved in important secure areas is designed to identify human with accuracy and reliability .",
        "correct sentence": "As we can see , the biometric identification employed in important security-sensitive areas is designed to identify people with accuracy and reliability ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 9,
                "error": "identifications",
                "correct": "identification purposes",
                "explanation": "The noun \"identification\" means the process of verifying someone's identity, but \"for identification\" does not contain the nuance of \"in order to.\" Adding \"purposes\" makes this intent clear."
            }
        ],
        "id": 122,
        "incorrect sentence": "Besides safety , convenience is also desirable for identifications .",
        "correct sentence": "Besides safety , convenience is also desirable for identification purposes ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 12,
                "error": "password",
                "correct": "passwords",
                "explanation": "\"Password\" is a noun phrase that requires an article or pluralization. The definite article \"the\" would imply one specific password, and the indefinite article \"a\" would mean one single unspecified password, neither of which is the intended meaning, so the plural should be used."
            },
            {
                "start": 13,
                "end": 13,
                "error": "-",
                "correct": "and",
                "explanation": "I don't agree with this correction because a clause cannot begin with neither followed by a verb. It should be changed to \"nor,\" which can begin a clause when followed by a verb."
            },
            {
                "start": 22,
                "end": 23,
                "error": "equipments",
                "correct": "equipment",
                "explanation": "\"Equipment\" is an uncountable noun, so it is already plural and cannot be pluralized with an \"s.\" "
            },
            {
                "start": 26,
                "end": 27,
                "error": "identification",
                "correct": "identity",
                "explanation": "Documents used to verify a person's identity are often called \"identification,\" so the phrase \"show one's identification\" means to present an ID card or similar document. Also, the goal of the process of identification is not to verify a person's identifying documents but to verify their \"identity,\" meaning who they are."
            }
        ],
        "id": 128,
        "incorrect sentence": "We do not want to spend time and effort to remember password , neither do we want to carry any cards or equipments to show our identification .",
        "correct sentence": "We do not want to spend time and effort to remember passwords , and neither do we want to carry any cards or equipment to show our identity ."
    },
    {
        "corrections": [
            {
                "start": 13,
                "end": 14,
                "error": "equipments",
                "correct": "equipment",
                "explanation": "\"Equipment\" is an uncountable noun, so it is already plural and cannot be pluralized with an \"s.\" "
            },
            {
                "start": 14,
                "end": 17,
                "error": "and time-saving progress",
                "correct": "-",
                "explanation": "The meaning of this phrase is unclear, so the editor may have chosen to delete it instead of guessing at a correction. If the meaning is \"time-saving process\" (rather than \"progress\"), I would suggest \"...they are also looking for small equipment as well as ways to save time in the process of identification.\""
            },
            {
                "start": 17,
                "end": 18,
                "error": "of",
                "correct": "for",
                "explanation": "The preposition \"of\" refers to attributes or ownership, and \"for\" means for the sake or purpose of. \"Equipment of identification\" would mean that the equipment belongs to identification or that equipment is an aspect of identification, which does not make sense. \"For\" communicates that the equipment is used for the purpose of identification."
            }
        ],
        "id": 133,
        "incorrect sentence": "For government and other organizations , they are also looking for small size equipments and time-saving progress of identification .",
        "correct sentence": "For government and other organizations , they are also looking for small size equipment for identification ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 3,
                "error": "the",
                "correct": "-",
                "explanation": "I don't agree with this correction because a process usually takes the definite article \"the\" when used in a sentence. This serves to distinguish it from other processes. It is unusual for \"process\" to be preceded by a modifying noun phrase but have no article."
            },
            {
                "start": 5,
                "end": 6,
                "error": "progress",
                "correct": "process",
                "explanation": "This is the wrong word. \"Progress\" means advancement or development, while \"process\" means a series of actions or steps taken toward a particular end."
            },
            {
                "start": 15,
                "end": 16,
                "error": "equipments",
                "correct": "equipment",
                "explanation": "\"Equipment\" is an uncountable noun, so it is already plural and cannot be pluralized with an \"s.\" "
            },
            {
                "start": 27,
                "end": 28,
                "error": "equipments",
                "correct": "equipment",
                "explanation": "\"Equipment\" is an uncountable noun, so it is already plural and cannot be pluralized with an \"s.\" "
            }
        ],
        "id": 139,
        "incorrect sentence": "Therefore nowadays the biometric identification progress is designed to be very quick , and the equipments can be easily set up or can be combined with other equipments .",
        "correct sentence": "Therefore nowadays biometric identification process is designed to be very quick , and the equipment can be easily set up or can be combined with other equipment ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 3,
                "error": "-",
                "correct": "a",
                "explanation": "The noun phrase fingerprint verification reader requires either an article or pluralization. The sentence begins with \"We can,\" suggesting a single outcome out of multiple potential outcomes. It would be unusual to use the definite article \"the\" to refer to a potential outcome because \"the\" normally refers to specific things. The indefinite article suggests that this is one of multiple potential fingerprint verification readers, allowing for different mechanisms, brands, etc. This meaning makes sense. The plural suggests that the statement applies to multiple different types of fingerprint verification readers, which also makes sense. Either the indefinite article or the plural is acceptable."
            },
            {
                "start": 8,
                "end": 8,
                "error": "-",
                "correct": "a",
                "explanation": "In this scenario, the smartcard reader is built into the fingerprint verification reader. Because the two readers are part of the same device, their articles should match. The fingerprint verification reader is already marked with the indefinite article \"a,\" meaning one of several potential options, so the smartcard reader should also use \"a.\""
            }
        ],
        "id": 143,
        "incorrect sentence": "We can have fingerprint verification reader combined with built-in smartcard reader , and it only takes seconds to verify one 's identification .",
        "correct sentence": "We can have a fingerprint verification reader combined with a built-in smartcard reader , and it only takes seconds to verify one 's identification ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "equipments",
                "correct": "equipment",
                "explanation": "\"Equipment\" is an uncountable noun, so it is already plural and cannot be pluralized with an \"s.\" "
            },
            {
                "start": 7,
                "end": 8,
                "error": "tend",
                "correct": "tends",
                "explanation": "The subject is \"equipment,\" which is uncountable and therefore treated as singular, so for subject-verb agreement, the verb should be \"tends.\""
            },
            {
                "start": 10,
                "end": 11,
                "error": "in-expensive",
                "correct": "inexpensive",
                "explanation": "This is a spelling error. The correct spelling is \"inexpensive.\""
            }
        ],
        "id": 149,
        "incorrect sentence": "Therefore , the equipments of biometric identification tend to be in-expensive .",
        "correct sentence": "Therefore , the equipment of biometric identification tends to be inexpensive ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 12,
                "error": "which",
                "correct": "-",
                "explanation": "When the relative pronoun \"which\" is used in a relative clause, it requires a second verb. \"Retinal Technologies, Inc. (RTI)\" is a relative clause, so if you use \"which,\" it will require a second verb."
            }
        ],
        "id": 152,
        "incorrect sentence": "For instance , Retinal Technologies , Inc. ( RTI ) , which captures a retinal image at distances from the user 's eye with the means of just using a patented aspheric lens array .",
        "correct sentence": "For instance , Retinal Technologies , Inc. ( RTI ) , captures a retinal image at distances from the user 's eye with the means of just using a patented aspheric lens array ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 12,
                "error": "benefit",
                "correct": "benefits",
                "explanation": "The noun \"benefit\" requires either pluralization or an article. It refers to a result of something, so it is often plural because it is assumed that any action can cause multiple results. Unless it is known that there is only one singular benefit, usually it is used in the plural."
            },
            {
                "start": 19,
                "end": 19,
                "error": "-",
                "correct": "the",
                "explanation": "I don't agree with this correction because the phrase \"the business,\" using the definite article \"the,\" refers to one specific company or to its operational results. When talking about something that will be beneficial in general and not just to one specific firm, it's common to say \"good for businesses,\" meaning good for all or most companies, or \"good for business,\" an idiom meaning good for stimulating commerce or economic growth."
            }
        ],
        "id": 159,
        "incorrect sentence": "This technology is widely used in our society and it brings benefit to the government , the military , business and every individual .",
        "correct sentence": "This technology is widely used in our society and it brings benefits to the government , the military , the business and every individual ."
    },
    {
        "corrections": [
            {
                "start": 10,
                "end": 11,
                "error": "human",
                "correct": "humans",
                "explanation": "There is a difference in nuance between \"humans\" and \"people.\" The word \"human\" is used more narrowly, mostly to refer to the human race as a whole, to distinguish human beings from other species, or to discuss human behavior in a scientific context. In most general, everyday uses, it's much more common to use \"people.\""
            },
            {
                "start": 27,
                "end": 29,
                "error": "benefits much",
                "correct": "brings tremendous benefits",
                "explanation": "The verb \"benefit\" does not take the preposition \"to\" or any preposition. Also, the phrase \"it benefits much those who shape it\" is not commonly used. First, \"much\" is not often used with \"benefit.\" It is more common to say \"significantly,\" \"tremendously,\" etc. Second, the word order \"it benefits tremendously (someone)\" is not commonly used. It is common to say \"it benefits (someone) tremendously\" or \"it brings tremendous benefits to (someone).\""
            },
            {
                "start": 32,
                "end": 33,
                "error": "shaped",
                "correct": "shape",
                "explanation": "The past tense refers to past events, so the past tense \"shaped\" implies that the field of biometric identification is fixed and that nobody can have any impact on it anymore. This is not true, so it should be changed to \"shape,\" the present tense form, to indicate that the field can still develop and change. "
            }
        ],
        "id": 164,
        "incorrect sentence": "All in all , biometric identification achieves great development as human seek for better information protection , easier life style and greater economic profit , and it benefits much to those who shaped it .",
        "correct sentence": "All in all , biometric identification achieves great development as humans seek for better information protection , easier life style and greater economic profit , and it brings tremendous benefits to those who shape it ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 3,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had come,\" refers to a time in the past. The phrase \"had come a long way since\" means that \"nuclear technology\" was completed at some unspecified point between 1917 and today, but this sentence is talking about the present, not the past. The tense of the auxiliary verb \"to have\" is changed in to make past perfect into present perfect, which is used when past events are related to the present or continue to impact the present. Therefore, the present perfect \"has come\" is used to refer to a present condition and imply that it is affected by past events."
            }
        ],
        "id": 173,
        "incorrect sentence": "Nuclear technology had come a long way since Ernest Rutherford first split the atom in 1917 .",
        "correct sentence": "Nuclear technology has come a long way since Ernest Rutherford first split the atom in 1917 ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 12,
                "error": "can",
                "correct": "could",
                "explanation": "This is referring to past events, so it is inappropriate to use the present tense \"can.\" The past tense \"could\" should be used instead."
            },
            {
                "start": 17,
                "end": 17,
                "error": "-",
                "correct": "has",
                "explanation": "The phrase \"the subsequent realization... sparked\" is in the past tense, so it refers entirely to past events, with no connection to today. To express that the effects are still continuing today, use the present perfect. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"sparked.\""
            }
        ],
        "id": 177,
        "incorrect sentence": "The subsequent realization that the additional neutrons produced from fission reaction can induce a nuclear chain reaction sparked off widespread interest in nuclear technology .",
        "correct sentence": "The subsequent realization that the additional neutrons produced from fission reaction could induce a nuclear chain reaction has sparked off widespread interest in nuclear technology ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had been,\" refers to a time in the past. The phrase \"had been exploited for\" means that the action was completed by a certain unspecified point in the past. To relate this to present day, use the present perfect. This requires the auxiliary verb \"have\" or \"has\" plus the past participle passive voice \"been exploited.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            },
            {
                "start": 7,
                "end": 8,
                "error": "through",
                "correct": "exploited for",
                "explanation": "\"Has been through\" comes from the phrasal verb \"go through,\" meaning to undergo a difficult period or experience. It is mostly used for people or for countries, and it is unusual to use it with a technology, which cannot experience suffering. The relationship between nuclear power and wars/arms races is better expressed by \"exploited for,\" which means to make full use of a resource and derive benefit from it. "
            },
            {
                "start": 9,
                "end": 10,
                "error": ",",
                "correct": "and",
                "explanation": "A list of two things cannot be linked by a comma. The conjunction \"and\" is necessary."
            },
            {
                "start": 13,
                "end": 14,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had found,\" refers to a time in the past. This phrase means that the action was completed by a certain unspecified point in the past. To relate this to present day, use the present perfect. This requires the auxiliary verb \"have\" or \"has\" plus the past participle passive voice \"been exploited.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            }
        ],
        "id": 183,
        "incorrect sentence": "Since then , nuclear technology had been through wars , arms races and had found many applications in the medical , industrial and energy fields .",
        "correct sentence": "Since then , nuclear technology has been exploited for wars and arms races and has found many applications in the medical , industrial and energy fields ."
    },
    {
        "corrections": [
            {
                "start": 14,
                "end": 15,
                "error": "sprung",
                "correct": "sprang",
                "explanation": "This sentence is referring to past events and requires the past tense. The past tense of the verb \"spring\" is \"sprang,\" not \"sprung.\""
            },
            {
                "start": 17,
                "end": 18,
                "error": "the",
                "correct": "-",
                "explanation": "The proper noun \"America\" doesn't take an article. The regions of North, South, and Central America can be referred to collectively as \"the Americas,\" but the singular \"America,\" referring to the United States, cannot."
            }
        ],
        "id": 196,
        "incorrect sentence": "The leakage of radioactive gas into the atmosphere prompted the many anti-nuclear demonstrations that sprung up across the America in the following months .",
        "correct sentence": "The leakage of radioactive gas into the atmosphere prompted the many anti-nuclear demonstrations that sprang up across America in the following months ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 12,
                "error": "damaged",
                "correct": "damage",
                "explanation": "\"Damaged\" is a past tense verb form, so it cannot be the subject of a clause. It should be changed to the noun form \"damage.\""
            }
        ],
        "id": 199,
        "incorrect sentence": "Although the reactor was eventually cleaned up and decontaminated , the damaged dealt to nuclear power was irreversible and caused its subsequent decline .",
        "correct sentence": "Although the reactor was eventually cleaned up and decontaminated , the damage dealt to nuclear power was irreversible and caused its subsequent decline ."
    },
    {
        "corrections": [
            {
                "start": 10,
                "end": 11,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had launched,\" refers to a time in the past. This phrase refers to something China had done as of a certain unspecified point in the past. But this 2030 plan is still ongoing today, so to relate this to present day, use the present perfect. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"launched.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            }
        ],
        "id": 205,
        "incorrect sentence": "To partly offset this gigantic demand for energy , China had launched an ambitious program to produce 16 % of its electricity from nuclear power by 2030 .",
        "correct sentence": "To partly offset this gigantic demand for energy , China has launched an ambitious program to produce 16 % of its electricity from nuclear power by 2030 ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "have",
                "correct": "has",
                "explanation": "The subject is \"this endeavor,\" which is singular, so for subject-verb agreement, the verb should be \"has.\""
            }
        ],
        "id": 208,
        "incorrect sentence": "This endeavor to produce more nuclear power have stimulated the development of safer designs of nuclear reactors .",
        "correct sentence": "This endeavor to produce more nuclear power has stimulated the development of safer designs of nuclear reactors ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 3,
                "error": "characterized",
                "correct": "characterize",
                "explanation": "This sentence is referring to events or conditions that are still ongoing, so it is inappropriate to use the past tense, which indicates past events. It should be changed to the present tense \"characterize.\""
            }
        ],
        "id": 212,
        "incorrect sentence": "Safety concerns characterized the basic concept of the Pebble Bed reactor with its passive safety design .",
        "correct sentence": "Safety concerns characterize the basic concept of the Pebble Bed reactor with its passive safety design ."
    },
    {
        "corrections": [
            {
                "start": 22,
                "end": 24,
                "error": ", instead",
                "correct": "; instead ,",
                "explanation": "This sentence joins two complete sentences with a comma and an adverb, which is not grammatically correct. Both \"When machinery... levels\" and \"instead, the reactor... liquids\" are complete sentences and they are related in meaning, so in order to join them, use either a conjunction or a semicolon."
            }
        ],
        "id": 217,
        "incorrect sentence": "When machinery failure occurs and reactor temperature increase to extremely high levels , the reactor does not undergo a meltdown or explode , instead temperature just stays at the high level until the heat can be dissipated or cooled by coolant liquids .",
        "correct sentence": "When machinery failure occurs and reactor temperature increase to extremely high levels , the reactor does not undergo a meltdown or explode ; instead , temperature just stays at the high level until the heat can be dissipated or cooled by coolant liquids ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had been,\" refers to a time in the past. The phrase \"had always been\" means that the action was completed by a certain unspecified point in the past. But this statement is about present events, so use the present perfect to relate it to present day. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"launched.\" This phrase conveys that the effects of this past action are still continuing or relevant today.\n"
            }
        ],
        "id": 220,
        "incorrect sentence": "In conclusion , nuclear technology development had always been driven by social factors .",
        "correct sentence": "In conclusion , nuclear technology development has always been driven by social factors ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "had",
                "correct": "has",
                "explanation": "I don't agree with this correction. The phrase \"World War 2 had given it momentum in its initial research\" is in the present perfect tense, which is used when the effects of past events are still relevant at present. However, nuclear technology is far past the stage of initial research where it required momentum from the war; it has been in practical use for a long time. Decades have passed since the end of the war that drove the research and since the initial research itself. Since neither one is ongoing or recent, I think the past tense \"gave\" is more appropriate than \"has given\" because the past tense refers to actions that were completed in the past."
            }
        ],
        "id": 223,
        "incorrect sentence": "World War 2 had given it momentum in its initial research , but it will be mankind 's need for a renewable and environmentally friendly energy source that will drive nuclear technology 's future developments .",
        "correct sentence": "World War 2 has given it momentum in its initial research , but it will be mankind 's need for a renewable and environmentally friendly energy source that will drive nuclear technology 's future developments ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 9,
                "error": "is trapping",
                "correct": "traps",
                "explanation": "The phrase \"is trapping\" is in the present continuous tense, referring to an action that is happening in the current moment. It's true that carbon dioxide is trapping heat now, but that is because it is trapping heat at all times. For events that occur constantly, regularly, or repeatedly, the present tense is used. It should be changed to \"traps\" to reflect that heat trapping is a constant characteristic of carbon dioxide, not a temporary effect at a specific moment."
            }
        ],
        "id": 226,
        "incorrect sentence": "Carbon dioxide is a greenhouse gas which is trapping heat within the Earth .",
        "correct sentence": "Carbon dioxide is a greenhouse gas which traps heat within the Earth ."
    },
    {
        "corrections": [
            {
                "start": 15,
                "end": 17,
                "error": "designing processes",
                "correct": "the process of designing such technologies",
                "explanation": "It's is not grammatically correct for a gerund to be followed by the verb \"process.\" The preposition \"of,\" which indicates an attribute, is used in \"the process of designing\" to reflect that designing constitutes the substance of the process. The phrase \"such technologies\" is added for specificity, as \"the process of designing\" is vague and could refer to designing anything. \"Such\" refers back to technologies that were referenced previously."
            }
        ],
        "id": 232,
        "incorrect sentence": "According to Khandani 's article on 'Engineering design process'1 , there are five steps to designing processes .",
        "correct sentence": "According to Khandani 's article on 'Engineering design process'1 , there are five steps to the process of designing such technologies ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "trap",
                "correct": "trapped",
                "explanation": "Both \"heat\" and \"trap\" are nouns, so they create a noun phrase \"heat trap,\" which refers to a type of plumbing valve. This sentence is about the heat trapped within the atmosphere, so it should use the adjective form \"trapped,\" which can modify the noun \"heat.\""
            }
        ],
        "id": 237,
        "incorrect sentence": "To reduce heat trap within the atmosphere , carbon dioxide level has to be reduced .",
        "correct sentence": "To reduce heat trapped within the atmosphere , carbon dioxide level has to be reduced ."
    },
    {
        "corrections": [
            {
                "start": 14,
                "end": 15,
                "error": "equipments",
                "correct": "equipment",
                "explanation": "\"Equipment\" is an uncountable noun, so it is already plural and cannot be pluralized with an \"s.\" "
            }
        ],
        "id": 241,
        "incorrect sentence": "Presently in the market , there are already technologies which can replace present day equipments and emit less carbon dioxide .",
        "correct sentence": "Presently in the market , there are already technologies which can replace present day equipment and emit less carbon dioxide ."
    },
    {
        "corrections": [
            {
                "start": 13,
                "end": 14,
                "error": "are",
                "correct": "is",
                "explanation": "The subject is \"information,\" which is a collective noun referring to a variety of data. It also represents an abstract concept that is uncountable. Therefore, the verb should be \"is\" for subject-verb agreement."
            },
            {
                "start": 20,
                "end": 21,
                "error": "articles",
                "correct": "-",
                "explanation": "The use of \"articles\" is unnecessarily wordy and confusing. Information is thought of as being disseminated by magazines and newspapers themselves, not by the articles they contain."
            }
        ],
        "id": 248,
        "incorrect sentence": "As the subject has been discussed for quite some time , relevant information are readily available on the internet and articles in magazines and newspapers .",
        "correct sentence": "As the subject has been discussed for quite some time , relevant information is readily available on the internet and in magazines and newspapers ."
    },
    {
        "corrections": [
            {
                "start": 17,
                "end": 18,
                "error": "improved",
                "correct": "overcome",
                "explanation": "The verb \"improve\" means to make something better, but it doesn't necessarily mean to solve a problem. For weaknesses, it's better to use a verb like \"overcome,\" which means to defeat or successfully deal with a difficulty."
            },
            {
                "start": 21,
                "end": 22,
                "error": "strength",
                "correct": "strengths",
                "explanation": "\"Strength\" is singular, which means only one strength. Generally, things and people are assumed to have multiple strengths and multiple weaknesses, so unless it is clear that there is only one, the plural is generally used. Also, because it is preceded by the plural \"weaknesses,\" it should be changed to the plural \"strengths\" for parallel structure."
            }
        ],
        "id": 253,
        "incorrect sentence": "These solutions may be generated by analyzing existing products to find out how the weaknesses can be improved while retaining the strength .",
        "correct sentence": "These solutions may be generated by analyzing existing products to find out how the weaknesses can be overcome while retaining the strengths ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 12,
                "error": "in the economic and social aspects",
                "correct": "based on economic and social considerations",
                "explanation": "\"Aspects\" means a part or feature of something. The phrase \"in the economic and social aspects\" means to analyze only the parts of these solutions that are relevant to the economy or to society. To convey the idea of analyzing solutions from an economic and social perspective, it should be changed to \"based on economic and social considerations.\""
            }
        ],
        "id": 261,
        "incorrect sentence": "They will then analyze the solutions in the economic and social aspects .",
        "correct sentence": "They will then analyze the solutions based on economic and social considerations ."
    },
    {
        "corrections": [
            {
                "start": 9,
                "end": 10,
                "error": "hence",
                "correct": "; hence ,",
                "explanation": "This sentence joins two complete sentences with an adverb, which is not grammatically correct. Both \"These products... market\" and \"hence... cost\" are complete sentences, so in order to join them, use either a conjunction or a semicolon."
            }
        ],
        "id": 264,
        "incorrect sentence": "These products have to be sold in the market hence consumers must be convinced that these environmentally friendly products are as good as the present equipment in terms of performance and cost .",
        "correct sentence": "These products have to be sold in the market ; hence , consumers must be convinced that these environmentally friendly products are as good as the present equipment in terms of performance and cost ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 5,
                "error": "the",
                "correct": "a",
                "explanation": "The definite article \"the\" refers to a specific product, especially one that was mentioned earlier in the text. Because no such product was mentioned, it should be changed to the indefinite article \"a,\" which refers to one single unspecified product out of multiple potential products."
            }
        ],
        "id": 267,
        "incorrect sentence": "Therefore careful analysis of the product has to be made before selecting a solution for testing and implementation .",
        "correct sentence": "Therefore careful analysis of a product has to be made before selecting a solution for testing and implementation ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 1,
                "error": "-",
                "correct": "to",
                "explanation": "The word \"according\" on its own is an adjective meaning harmonious or in agreement. In order to create a prepositional phrase meaning \"as stated by,\" it requires the preposition \"to.\" It should be changed from \"according\" to \"according to.\""
            }
        ],
        "id": 271,
        "incorrect sentence": "According Khandani 's article , engineers can test the solution by prototyping or concurrent engineering .",
        "correct sentence": "According to Khandani 's article , engineers can test the solution by prototyping or concurrent engineering ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "hence",
                "correct": "; hence ,",
                "explanation": "This sentence joins two complete sentences with an adverb, which is not grammatically correct. Both \"These computer simulations... time\" and \"hence... time\" are complete sentences, so in order to join them, use either a conjunction or a semicolon."
            },
            {
                "start": 8,
                "end": 10,
                "error": "it is",
                "correct": "they are",
                "explanation": "This statement is referring to a previous subject, \"these computers,\" which is plural. Therefore, for subject-verb agreement, \"they are\" should be used instead."
            }
        ],
        "id": 279,
        "incorrect sentence": "These computer simulations take significantly shorter time hence it is a preferred choice as it means that the product can be sold in the market in a shorter period of time .",
        "correct sentence": "These computer simulations take significantly shorter time ; hence , they are a preferred choice as it means that the product can be sold in the market in a shorter period of time ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "process",
                "correct": "product",
                "explanation": "This is the wrong word. \"Process\" means a series of actions or steps taken toward a particular end, while \"product\" means an article or substance produced for sale. From prior context, the author is talking about technologies, so \"product\" is the more likely meaning. "
            }
        ],
        "id": 282,
        "incorrect sentence": "Through the five designing steps , a process can be designed to meet the need to decrease carbon dioxide level .",
        "correct sentence": "Through the five designing steps , a product can be designed to meet the need to decrease carbon dioxide level ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 2,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had shown,\" refers to a time in the past. This phrase means that the action was completed by a certain unspecified point in the past. But this statement is about present events, so use the present perfect to relate it to present day. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"shown.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            },
            {
                "start": 6,
                "end": 7,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had increased,\" refers to a time in the past. This phrase means that the action was completed by a certain unspecified point in the past. But this statement is about a specified period, or the last decade, so use the present perfect to relate it to present day. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"increased.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            },
            {
                "start": 16,
                "end": 17,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had projected,\" refers to a time in the past. This phrase means that the action was completed by a certain unspecified point in the past. But this statement is about present events, so use the present perfect to relate it to present day. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"projected.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            },
            {
                "start": 25,
                "end": 25,
                "error": "-",
                "correct": "near",
                "explanation": "The verb \"draw\" on its own means to pull or drag, or to produce a picture. It needs \"near\" in order to convey the meaning of to approach or grow closer."
            }
        ],
        "id": 296,
        "incorrect sentence": "Research had shown that fuel consumption had increased twenty percent over the last decade , and had projected that the depletion of fuels is drawing .",
        "correct sentence": "Research has shown that fuel consumption has increased twenty percent over the last decade , and has projected that the depletion of fuels is drawing near ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "emit",
                "correct": "emits",
                "explanation": "The subject here is \"burning,\" which is singular, so the verb should be \"emits\" for subject-verb agreement."
            },
            {
                "start": 10,
                "end": 10,
                "error": "-",
                "correct": "which",
                "explanation": "The phrase \"pollute our fragile environment\" modifies the phrase \"various harmful gases\" to clarify its meaning. Therefore, the relative noun \"which\" is needed to connect the two clauses. Otherwise it is a run-on sentence."
            }
        ],
        "id": 300,
        "incorrect sentence": "In addition , burning of fuels emit various harmful gases pollute our fragile environment .",
        "correct sentence": "In addition , burning of fuels emits various harmful gases which pollute our fragile environment ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 9,
                "error": "to",
                "correct": "of",
                "explanation": "This sentence uses the noun \"cause,\" meaning a person or thing that gives rise to something. In such cases, \"cause\" takes the pronoun \"of,\" which is used to indicate what caused an event. Therefore, the phrase \"the main cause of global warming\" means \"the main thing that causes global warming.\""
            },
            {
                "start": 13,
                "end": 14,
                "error": "give",
                "correct": "gives",
                "explanation": "The subject here is \"global warming,\" which is singular, so the verb should be \"gives\" for subject-verb agreement."
            }
        ],
        "id": 304,
        "incorrect sentence": "These green house gases are the main cause to worldwide global warming which give rise to further catastrophes such as the rise in global temperature etc .",
        "correct sentence": "These green house gases are the main cause of worldwide global warming which gives rise to further catastrophes such as the rise in global temperature etc ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 5,
                "error": "had",
                "correct": "have",
                "explanation": "The past perfect form, \"had already started,\" refers to a time in the past. This phrase means that the action was completed by a certain unspecified point in the past. But this statement is about present events, so use the present perfect to relate it to present day. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"started.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            }
        ],
        "id": 307,
        "incorrect sentence": "Engineers around the world had already started on working on this problem .",
        "correct sentence": "Engineers around the world have already started on working on this problem ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 3,
                "error": "them",
                "correct": "themselves",
                "explanation": "\"Themselves\" is used to emphasize that the subject or object is one that has already been referenced. This sentence is saying that engineers have a set of steps that guide them, so both the subject \"they\" and the object \"them(selves)\" refer to the same thing: \"engineers.\" In such cases, \"themselves\" is used to indicate that the pronoun is something that has already been mentioned."
            },
            {
                "start": 13,
                "end": 14,
                "error": "use",
                "correct": "have used",
                "explanation": "The present tense \"use\" refers to an action that is currently or habitually performed. In this case, engineers have been performing the action since some time ago and still do so now. That is best expressed by the present perfect tense, \"have used,\" which indicates that a past action is either still ongoing today or that its effects still endure."
            },
            {
                "start": 19,
                "end": 26,
                "error": "which guide them in engineering a remedy",
                "correct": "-",
                "explanation": "The idea of \"which guide them\" is already expressed in \"To guide them,\" so it should be deleted to avoid repetition. There is nothing grammatically wrong with \"in engineering a remedy,\" so this a stylistic edit, but the phrase adds little to the idea of \"saving the earth.\" It's also unnecessarily wordy and potentially confusing, so deleting it achieves a clearer argument."
            }
        ],
        "id": 312,
        "incorrect sentence": "To guide them in this heavy responsibility of saving the earth , they use a set of simple steps which guide them in engineering a remedy , known as the Engineering Design Process .",
        "correct sentence": "To guide themselves in this heavy responsibility of saving the earth , they have used a set of simple steps , known as the Engineering Design Process ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 9,
                "error": "mainly",
                "correct": "namely",
                "explanation": "This is the wrong word. \"Mainly\" means principally or for the most part, suggesting that there are other steps as well, but these are the five most important steps. \"Namely\" is a way of rephrasing a previously mentioned concept to be more exact, like \"to be specific.\" It should be changed to \"namely\" to indicate that there are exactly five steps, which the author will then mention by name."
            },
            {
                "start": 33,
                "end": 34,
                "error": "it",
                "correct": "the ideas",
                "explanation": "The pronoun is replacing the plural \"ideas,\" so it is ungrammatical to use the singular pronoun \"it.\" Also, the third and fourth steps both use the phrase \"the ideas\" rather than substituting a pronoun, so the reader will expect to hear \"the ideas\" in the fifth step as well. This creates parallel structure."
            }
        ],
        "id": 316,
        "incorrect sentence": "This process consists of five major steps , mainly defining the problem , researching on information pertaining to the problem , brainstorming of ideas , filtering of the ideas , and lastly implementing it .",
        "correct sentence": "This process consists of five major steps , namely defining the problem , researching on information pertaining to the problem , brainstorming of ideas , filtering of the ideas , and lastly implementing the ideas ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 12,
                "error": "of",
                "correct": "for",
                "explanation": "The preposition \"of\" indicates an attribute or a relationship of belonging, so \"the search of alternative resources\" suggests that alternative resources are conducting the search, which is not logical. The preposition \"for\" can mean the purpose for which something is done, or in order to help or cause something. The purpose of a search is to find an object, so \"for\" is used for the object."
            }
        ],
        "id": 319,
        "incorrect sentence": "Firstly , we can define this worldwide problem as the search of alternative resources to the existing near-depletion fuels .",
        "correct sentence": "Firstly , we can define this worldwide problem as the search for alternative resources to the existing near-depletion fuels ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 9,
                "error": "so much",
                "correct": "a lot of",
                "explanation": "I may agree with this correction depending on the intended meaning. The issue is about the plural \"gases,\" which only ever means multiple gases, such as hydrogen gas, chlorine gas, etc. When referring to one gas, the word \"gas\" is not pluralized, regardless of how large the amount of gas may be. In other words, \"gases\" is countable and \"gas\" is sometimes countable, sometimes not. \"Much\" is used only to modify uncountable nouns, so it cannot be used with \"gases.\" The phrase \"a lot of\" can be used with either countable or uncountable nouns, but with different meanings. \"A lot of gas\" means a large amount of gas, either one single gas or multiple gases. \"A lot of gases\" means many different gases, but does not indicate in what amount. If the author intends to say that fuels emit many different gases, the correction \"a lot of gases\" is valid. If the intended meaning is that fuel emits a large amount of gas or of gases, then it should be changed to \"a large amount of gas\" or \"large amounts of gases,\" respectively."
            },
            {
                "start": 23,
                "end": 24,
                "error": "one",
                "correct": "energy source",
                "explanation": "\"One\" is used as a pronoun used to reference something that has already been mentioned. In this case, it means \"alternatives,\" but \"alternatives\" is plural, so it cannot be replaced with the singular pronoun \"one.\" Also, since \"alternatives\" is the subject, the current meaning of the sentence is \"The alternatives we are looking for should be renewable alternatives,\" but alternatives to what? This is unclear, so it should be changed to something more specific, like \"energy sources.\" (I've used the plural \"energy sources\" because, although the correction is valid overall, as it is incorrect to use the singular \"energy source\" with the plural \"alternative.\") "
            },
            {
                "start": 25,
                "end": 25,
                "error": "-",
                "correct": "should",
                "explanation": "The verb \"should\" is missing. The sentence can be understood without it, but it is unusual and grammatically incorrect to use the verb for the first item of a two-item list but omit it for the second."
            }
        ],
        "id": 324,
        "incorrect sentence": "Since fuels are non renewable and emit so much harmful gases , the alternatives that we are looking for should be a renewable one and not emit harmful pollutants .",
        "correct sentence": "Since fuels are non renewable and emit a lot of harmful gases , the alternatives that we are looking for should be a renewable energy source and should not emit harmful pollutants ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 2,
                "error": "had",
                "correct": "have",
                "explanation": "The past perfect form, \"had shown,\" refers to a time in the past. This phrase means that the action was completed by a certain unspecified point in the past. But this statement is about present events, so use the present perfect to relate it to present day. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"shown.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            }
        ],
        "id": 328,
        "incorrect sentence": "Studies had shown that an average of 2 lbs ( pounds ) of fuel is needed to produce 1kilowatt of power .",
        "correct sentence": "Studies have shown that an average of 2 lbs ( pounds ) of fuel is needed to produce 1kilowatt of power ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 5,
                "error": "realized",
                "correct": "realize",
                "explanation": "I partially agree with this correction. \"Realized\" is not correct because it is the past tense, which refers to events that were completed in the past. However, the present tense \"realize\" is not correct either. The present tense refers to events that are currently ongoing or that occur regularly, but this realization is not currently in progress, nor is it occurring repeatedly. It occurred in the past but it still has an effect on our present. The present perfect tense is used for events that took place in the past but still affect the present, so the present perfect \"have realized\" is preferable."
            },
            {
                "start": 9,
                "end": 10,
                "error": "produce",
                "correct": "produces",
                "explanation": "The subject is \"burning,\" which is singular, so the verb should be changed to \"produces\" to match."
            },
            {
                "start": 10,
                "end": 11,
                "error": "the",
                "correct": "a",
                "explanation": "The definite article \"the\" refers to a specific amount of gas or gases, especially one that was mentioned earlier in the text. Because no such amount was mentioned, it should be changed to the indefinite article \"a,\" which refers to an unspecified or unknowable amount of gas or gases."
            }
        ],
        "id": 333,
        "incorrect sentence": "In addition , we realized that burning of fuels produce the large amount of greenhouse gases .",
        "correct sentence": "In addition , we realize that burning of fuels produces a large amount of greenhouse gases ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 4,
                "error": "-",
                "correct": ",",
                "explanation": "A comma is necessary when \"which\" precedes a nonrestrictive phrase, meaning a phrase that can be removed from the sentence without changing the meaning. The phrase \"An example is water\" is a full sentence whose meaning does not change if the clause that follows is removed, so the clause is nonrestrictive and a comma should be added."
            }
        ],
        "id": 341,
        "incorrect sentence": "An example is water which is a good renewable resource and is plentiful .",
        "correct sentence": "An example is water , which is a good renewable resource and is plentiful ."
    },
    {
        "corrections": [
            {
                "start": 14,
                "end": 14,
                "error": "-",
                "correct": "amount of",
                "explanation": "The phrase \"same energy\" is not used in the context of \"energy\" meaning usable power. It is used only for another meaning of \"energy\": aura, ambience, or mood. Also, the word \"energy\" on its own just means usable power, and it does not denote any amount at all. Without \"amount of,\" the meaning of the sentence is partially lost."
            }
        ],
        "id": 345,
        "incorrect sentence": "This is because a large body of water is needed to harness the same energy produced by a small amount of fuel .",
        "correct sentence": "This is because a large body of water is needed to harness the same amount of energy produced by a small amount of fuel ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 9,
                "error": "the",
                "correct": "-",
                "explanation": "The definite article \"the\" refers to a specific group of engineers, especially one that was mentioned earlier in the text. Because no such group was mentioned, the article should be removed, in which case the plural \"engineers\" means most or all engineers, or any relevant engineers."
            }
        ],
        "id": 348,
        "incorrect sentence": "All the solutions will be thoroughly analysed by the engineers before coming to a conclusion .",
        "correct sentence": "All the solutions will be thoroughly analysed by engineers before coming to a conclusion ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 3,
                "error": "the",
                "correct": "-",
                "explanation": "The definite article \"the\" refers to a specific group of engineers, especially one that was mentioned earlier in the text. Because no such group was mentioned, the article should be removed, in which case the plural \"engineers\" means most or all engineers, or any relevant engineers."
            }
        ],
        "id": 351,
        "incorrect sentence": "Lastly , the engineers will put their solution to test and ensure that the solution is able to solve the problem .",
        "correct sentence": "Lastly , engineers will put their solution to test and ensure that the solution is able to solve the problem ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 6,
                "error": "made use",
                "correct": "make use of",
                "explanation": "The phrase \"make use of\" is commonly used and it always requires the preposition \"of.\" Also, this sentence is referring to events or conditions that are still ongoing, so it is inappropriate to use the past tense, which indicates past events. It should be changed to the present tense \"make use of.\""
            }
        ],
        "id": 354,
        "incorrect sentence": "As such , engineers made use wind turbines and water hydraulic generators to harness the wind and water energy respectively .",
        "correct sentence": "As such , engineers make use of wind turbines and water hydraulic generators to harness the wind and water energy respectively ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 1,
                "error": "It",
                "correct": "Harnessing the wind and water energy",
                "explanation": "I partially agree with this correction. The pronoun \"It\" does lack clarity, but rather than repeating the subject of the previous sentence, I would change it to \"This,\" which refers back to the subject of the previous sentence. It's more common to substitute a pronoun for the subject unless the last mention of the subject is far away. In this case, it was last mentioned at the end of the previous sentence, so the reader still remembers it at the start of this sentence, and it is unusual to repeat a long phrase twice in such quick succession."
            },
            {
                "start": 7,
                "end": 7,
                "error": "-",
                "correct": ",",
                "explanation": "The conjunction \"but\" is used to link two contradictory or seemingly contradictory ideas. When these ideas are independent clauses, meaning that they each form a full sentence on their own, then \"but\" always requires a comma. Both \"Harnessing... option\" and \"both sources... resources\" have a subject and a verb, making them both full sentences. Therefore, they can be connected with a comma and the conjunction \"but.\""
            },
            {
                "start": 22,
                "end": 26,
                "error": "depleting resource - fuel",
                "correct": "depletion of fuel resources",
                "explanation": "First, remove the dash, which defines \"the depleting resource\" as \"fuel.\" Then, change to the noun phrase \"fuel resources,\" meaning the stock or supply of fuel, because it more clearly communicates that the finite amount of fuel in existence is diminishing. In the phrase \"slow down the depleting fuel resources,\" the object of the verb \"to slow down\" is \"fuel.\" This means fuel is being slowed down fuel, so the phrase should be modified to convey that what's being slowed down is the depletion of fuel. To do this, change \"depleting\" to \"depletion of.\""
            }
        ],
        "id": 359,
        "incorrect sentence": "It may not be the best option but both sources are renewable and are able to be used to slow down the depleting resource - fuel .",
        "correct sentence": "Harnessing the wind and water energy may not be the best option , but both sources are renewable and are able to be used to slow down the depletion of fuel resources ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 2,
                "error": "had",
                "correct": "has",
                "explanation": "The past perfect form, \"had shown,\" refers to a time in the past. This phrase means that the action was completed by a certain unspecified point in the past. But this statement is about present events, so use the present perfect to relate it to present day. This requires the auxiliary verb \"have\" or \"has\" plus the past participle \"shown.\" This phrase conveys that the effects of this past action are still continuing or relevant today."
            },
            {
                "start": 13,
                "end": 13,
                "error": "-",
                "correct": ",",
                "explanation": "The conjunction \"and\" is used to link two ideas. When these ideas are independent clauses, meaning that they each form a full sentence on their own, then \"and\" requires a comma. Both \"This has... solving problems\" and \"it ensures... harmful (gases)\" are full sentences, so they can be connected with a comma and the conjunction \"but.\""
            },
            {
                "start": 24,
                "end": 25,
                "error": "ensure",
                "correct": "-",
                "explanation": "The conjunction \"that\" serves to connect the phrase \"the engineers... harmful (gases)\" to the verb \"ensures,\" so there is no need to repeat the verb. If choosing to repeat the verb for stylistic reasons, it should be changed from \"ensure\" to \"ensures\" so that it agrees with the subject \"it,\" which is singular."
            },
            {
                "start": 32,
                "end": 33,
                "error": "target",
                "correct": "address",
                "explanation": "The verb \"target\" means to take aim at, particularly with an attack or a message, while \"address\" means to deal with a problem and attempt to solve it. \"Target\" does not contain the nuance of solving, so it is not commonly used with \"problems,\" and \"address\" is the better choice."
            },
            {
                "start": 39,
                "end": 39,
                "error": "-",
                "correct": "of fuels",
                "explanation": "\"Fuels\" has not been mentioned in this sentence, so it is unclear what \"the depletion\" is referencing. "
            },
            {
                "start": 40,
                "end": 42,
                "error": "harmful fuel",
                "correct": "the emission of harmful gages",
                "explanation": "The phrase \"harmful fuel\" means that fuel itself is harmful, which is not true. The harm comes from gases, which are emitted during the extraction and burning of fuels. To accurately reflect what \"the main problem\" is, it should be changed to \"the emission of harmful gases.\""
            }
        ],
        "id": 367,
        "incorrect sentence": "This had shown that the engineering design process is essential in solving problems and it ensures that the problem is thoroughly looked into and ensure that the engineers are generating ideas that target the main problem , the depletion and harmful fuel .",
        "correct sentence": "This has shown that the engineering design process is essential in solving problems , and it ensures that the problem is thoroughly looked into and that the engineers are generating ideas that address the main problem , the depletion of fuels and the emission of harmful gages ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 2,
                "error": "-",
                "correct": "adoption of the",
                "explanation": "This is a stylistic correction, not a grammatical one. The sentence is more clear with the addition of \"adoption of\" because the phrase \"Since the reform and open policy\" alone implies that the policy was an event that occurred naturally or without human action. Since policies are a human invention, it is more common to say \"Since the adoption of the...\" "
            },
            {
                "start": 7,
                "end": 7,
                "error": "-",
                "correct": "the",
                "explanation": "When used as a noun, a decade always uses the definite article \"the.\" This is because the definite article is used to refer to a particular unit or period of time. The decade of the 1970s only occurred once, so it is a specific, definite thing, and the article should be used."
            },
            {
                "start": 16,
                "end": 20,
                "error": "on its way to",
                "correct": "its process of",
                "explanation": "The noun phrase \"on its way to\" means being in progress or in a state of development toward something. It is a state of being, not an action, and the verb phrase \"to speed up\" is basically only used with actions or vehicles. Therefore, \"process\" is a better word choice because it means a series of actions that lead to a particular result."
            },
            {
                "start": 22,
                "end": 23,
                "error": "flourish",
                "correct": "development",
                "explanation": "Firstly, \"on its way to\" followed by the verb \"flourish\" is not grammatically correct. \"Flourish\" should be changed to the gerund \"flourishing\" when used in the phrase \"in the process of,\" because this phrase requires a noun and gerunds can act as a noun. Secondly, the word \"flourish\" is not commonly used in this context, so it should be changed to \"development.\""
            }
        ],
        "id": 374,
        "incorrect sentence": "Since the reform and open policy in 1970 's , China has been eagerly speeding up on its way to industrialization and flourish .",
        "correct sentence": "Since the adoption of the reform and open policy in the 1970 's , China has been eagerly speeding up its process of industrialization and development ."
    },
    {
        "corrections": [
            {
                "start": 9,
                "end": 12,
                "error": "stand out becoming",
                "correct": "are",
                "explanation": "This correction does not fix the problem. The phrase \"stand out becoming\" is not correct in English. To convey the meaning of \"prominent,\" it should say something like \"two major difficulties that have become prominent are the education system and the perception of innovation.\" This means that China faces multiple major difficulties, and that two in particular are now very noticeable: the education system and the perception of innovation. Also, this correction adds the definite article \"the\" to both of the difficulties. \"The\" is used to refer to one specific thing, so it means \"China's\" education system\" and \"China's perception of innovation.\""
            }
        ],
        "id": 378,
        "incorrect sentence": "Among them , education system and perception of innovation stand out becoming two major difficulties .",
        "correct sentence": "Among them , education system and perception of innovation are two major difficulties ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "deeply",
                "correct": "greatly",
                "explanation": "The adverb \"deeply\" means complete, extreme, or strongly felt. It is not commonly used with \"throttling.\" It's more common to use \"greatly,\" which has a similar meaning: to a great extent or degree."
            }
        ],
        "id": 383,
        "incorrect sentence": "However , China 's examination-oriented education system deeply throttles students ' creativity .",
        "correct sentence": "However , China 's examination-oriented education system greatly throttles students ' creativity ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 7,
                "error": "-",
                "correct": "the",
                "explanation": "\"The whole society\" is an idiom meaning all parts of society, or basically every member of society. \"The whole...\" means complete or full, not lacking or leaving out any part. This idiom is always used with the article \"the.\""
            },
            {
                "start": 11,
                "end": 14,
                "error": "concentrating on how",
                "correct": "-",
                "explanation": "1) I partially agree with this question. The phrase \"concentrating on how\" needs to be removed, but the meaning still is not conveyed strongly enough. First, the verb \"pressure\" is stronger than \"push.\" Second, the sentence should use the passive voice, in which the subject undergoes the action of the verb. This makes \"students\" the subject, the passive particle \"are pressured\" is the verb. The sentence \"Students are pressured to achieve outstanding marks in examinations not only by parents and teachers but also by the whole society\" shifts the focus to students and emphasizes the intensity of the pressure.\n\n2) Not only parents and teachers but all of society is pressuring students to achieve outstanding marks in examination.\nOR　\nNot only parents and teachers, but society as a whole, is pressuring students to achieve outstanding marks in examination.\n\nEither way, the main idea is that society is pushing students to get good marks. This idea remains intact even if the confusing phrase \"concentrating on how\" is removed, so it's better to remove it."
            }
        ],
        "id": 387,
        "incorrect sentence": "Not only parents and teachers but also whole society pushes students concentrating on how to get outstanding marks in examinations .",
        "correct sentence": "Not only parents and teachers but also the whole society pushes students to get outstanding marks in examinations ."
    },
    {
        "corrections": [
            {
                "start": 18,
                "end": 27,
                "error": "for the simple reason that these can help them",
                "correct": "simply to",
                "explanation": "This is a stylistic correction, not a grammatical one. \"For the simple reason that these can help them\" is grammatically correct, but \"simply to\" expresses the same idea much more concisely and clearly, and with less possibility for confusion."
            }
        ],
        "id": 390,
        "incorrect sentence": "Students spend most of their time reciting details in text books and doing tedious exercises again and again for the simple reason that these can help them get familiar with examinations .",
        "correct sentence": "Students spend most of their time reciting details in text books and doing tedious exercises again and again simply to get familiar with examinations ."
    },
    {
        "corrections": [
            {
                "start": 13,
                "end": 13,
                "error": "-",
                "correct": "abilities",
                "explanation": "The phrase \"creative thinking\" refers to the process of thinking creatively. In this sentence, \"creative thinking\" is the object of the verb \"develop,\" but what the students are developing is not the process of thinking creatively, but the ability to think creatively. Also, creative thinking is considered to require a variety of different abilities, such as analytical skills, innovation, brainstorming, the empathy to see things from other peoples' perspectives, etc. Therefore, \"abilities\" is always plural in the phrase \"creative thinking abilities.\""
            },
            {
                "start": 16,
                "end": 17,
                "error": "stereotype",
                "correct": "-",
                "explanation": "\"Stereotype\" requires an article, and it should be changed to \"a stereotype,\" because the indefinite article \"a\" implies one of several or many potential stereotypes whereas the definite article \"the\" implies one specific stereotype, usually one mentioned previously in the text. \"The\" is appropriate here because no stereotype was mentioned previously in the text. The correction, however, removes \"stereotype\" entirely. The sentence ends with the word \"become,\" which requires an object. This is ungrammatical and also vague because it does not specify what the students are becoming."
            }
        ],
        "id": 394,
        "incorrect sentence": "As a result , students have no chance to develop their creative thinking and gradually become stereotype .",
        "correct sentence": "As a result , students have no chance to develop their creative thinking abilities and gradually become ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "is",
                "correct": "was",
                "explanation": "The phrase \"Many years ago\" means that this statement is referring to past events, so it is inappropriate to use the present tense \"is.\" It should be \"was\" instead."
            }
        ],
        "id": 397,
        "incorrect sentence": "Many years ago , the situation is different .",
        "correct sentence": "Many years ago , the situation was different ."
    },
    {
        "corrections": [
            {
                "start": 10,
                "end": 11,
                "error": "major",
                "correct": "majoring",
                "explanation": "The verb \"major\" is in the present tense, but it is preceded by the past tense verb \"entered,\" which refers to past events. It should be changed to the gerund \"majoring,\" which expresses a condition. Also, the bare infinitive present tense can only begin a clause when used as a command."
            }
        ],
        "id": 400,
        "incorrect sentence": "In 1931 , Qian Weichang entered Tsing Hua University , major in history with 0 marks in mathematics and physics .",
        "correct sentence": "In 1931 , Qian Weichang entered Tsing Hua University , majoring in history with 0 marks in mathematics and physics ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 5,
                "error": "-",
                "correct": "s",
                "explanation": "The possessive \"one year's study\" is used to mean \"study of one year.\" The pronoun \"of\" can indicate what an amount or number refers to. It also refers to a relationship of ownership. The year was spent studying, so the year belonged to study, so it is one year of study."
            }
        ],
        "id": 403,
        "incorrect sentence": "However , after one year study , he found history not suitable for himself and became interested in physics and showed great talent .",
        "correct sentence": "However , after one year s study , he found history not suitable for himself and became interested in physics and showed great talent ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 3,
                "error": "-",
                "correct": "of",
                "explanation": "The pronoun \"of\" is used to indicate what an amount or number refers to, or it can also refer to a relationship of ownership. Qian Weichiang spent several years studying, so those years belonged to study, so they are called \"years of study.\""
            }
        ],
        "id": 407,
        "incorrect sentence": "After several years researching and studying , Qian Weichang made many great breakthroughs in physics .",
        "correct sentence": "After several years of researching and studying , Qian Weichang made many great breakthroughs in physics ."
    },
    {
        "corrections": [
            {
                "start": 43,
                "end": 43,
                "error": "-",
                "correct": "for",
                "explanation": "The phrase \"stay another year\" is used in spoken English and casual contexts, but in formal writing, the grammatically correct phrase \"stay for another year\" should be used. The preposition \"for\" is used to indicate an amount of time or space, in this case, one more year."
            },
            {
                "start": 46,
                "end": 46,
                "error": "-",
                "correct": "the",
                "explanation": "With the definite article \"the,\" the phrase \"the secondary school\" refers to a specific secondary school. \"Secondary school\" with no article means secondary school in a less specific sense. The meaning of this sentence is not that the student was asked to remain at a specific secondary school for another year, but to remain a secondary school student for another year, so the more general \"secondary school\" is a better choice."
            },
            {
                "start": 62,
                "end": 63,
                "error": "1",
                "correct": "-",
                "explanation": "The phrase \"the top student\" is a common phrase meaning \"the number-one student.\" The adjective \"top\" means highest in rank. Combined with the definite article \"the,\" which refers to one specific thing, it can only mean the number-one performing student in his province. The number is redundant and ungrammatical, so it should be removed."
            }
        ],
        "id": 413,
        "incorrect sentence": "Recently , a student got a very good result in the National College Entrance Examination ( NCEE ) , but he did not enter the university which he applied for , because the secondary school offered him ¥ 100,000 encouraging him to stay another year in secondary school for the next year 's NCEE , expecting that he could become the top 1 student in his province .",
        "correct sentence": "Recently , a student got a very good result in the National College Entrance Examination ( NCEE ) , but he did not enter the university which he applied for , because the secondary school offered him ¥ 100,000 encouraging him to stay for another year in the secondary school for the next year 's NCEE , expecting that he could become the top student in his province ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "exploring",
                "correct": "exploration",
                "explanation": "I agree that the sentence needs correction, but the suggested correction does not fix the issue. The preposition \"by\" is used for a means of achieving a certain outcome, but only with gerunds like \"exploring,\" not with nouns like \"exploration.\" For nouns, \"through\" is used instead. However, neither \"by students' exploring\" nor \"through students' exploration\" is commonly used. A better correction would be \"through self-exploration and independent learning.\""
            }
        ],
        "id": 416,
        "incorrect sentence": "Creativity is developed by students ' exploring through their self-learning .",
        "correct sentence": "Creativity is developed by students ' exploration through their self-learning ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "qualified",
                "correct": "-",
                "explanation": "The adjective \"qualified\" means having the necessary skills to perform a particular task, but it refers mainly to official or certified qualifications, such as tests. There is no test that would certify someone's creative thinking abilities, so \"qualified\" should be omitted. The sentence could also be reworded to \"human resources with creative thinking abilities,\" but \"creative human resources\" expresses the same idea more concisely and with less potential for confusion."
            },
            {
                "start": 8,
                "end": 9,
                "error": "resource",
                "correct": "resources",
                "explanation": "The phrase \"human resources\" refers to a group of people who are able to do work. Because it refers to a group, it is only used in the plural in principle. "
            }
        ],
        "id": 421,
        "incorrect sentence": "Therefore , the lack of creative qualified human resource seriously hampers engineering design processes for innovations in China .",
        "correct sentence": "Therefore , the lack of creative human resources seriously hampers engineering design processes for innovations in China ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 7,
                "error": "to make",
                "correct": "from making",
                "explanation": "The preposition \"to\" refers to directionality, or flowing toward an object, whereas \"from\" can imply separation or removal from an object. Given this, \"discourage from\" makes sense because the engineers are stopped from making more effort. The phrase \"discourage to\" is not grammatically correct, but it would imply something like making a demoralizing remark to someone, which is not the meaning of this sentence."
            },
            {
                "start": 15,
                "end": 16,
                "error": "for",
                "correct": "and",
                "explanation": "The phrase \"for they have\" is an archaic way of saying \"because they have.\" If the author wants to say that having little motivation to work hard discourages the engineers from making efforts, then it is understandable, but modern English phrases this as \"because they have little motivation to work hard.\" If the author wants to say that the problem both discourages engineers from making efforts and takes away their motivation to work hard, then the correction is valid."
            },
            {
                "start": 17,
                "end": 18,
                "error": "will",
                "correct": "-",
                "explanation": "Using the future tense \"will\" refers to future events, but the rest of this sentence is about ongoing events, so the present tense should be used. It is also clearer and more assertive to say \"they have.\""
            }
        ],
        "id": 430,
        "incorrect sentence": "This problem significantly discourages engineers to make more effort to do research and design , for they will have little motivation to work hard .",
        "correct sentence": "This problem significantly discourages engineers from making more effort to do research and design , and they have little motivation to work hard ."
    },
    {
        "corrections": [
            {
                "start": 12,
                "end": 16,
                "error": "and industry updates frequently",
                "correct": "-",
                "explanation": "The idea that industries change frequently has no connection to the previous sentence or the previous clause, and it is not explained in the next sentence either. It should be deleted because its connection to the writer's argument is unclear."
            }
        ],
        "id": 435,
        "incorrect sentence": "Therefore , people are well motivated to do research and design , and industry updates frequently .",
        "correct sentence": "Therefore , people are well motivated to do research and design , ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 0,
                "error": "-",
                "correct": "The",
                "explanation": "When used as a noun, a century always uses the definite article \"the.\" This is because the definite article is used to refer to a particular unit or period of time. The 21st century will only occur once, so it is a specific, definite thing. The article \"the\" reflects this best."
            },
            {
                "start": 2,
                "end": 12,
                "error": "will be a more competitive and challenging opportunity for China",
                "correct": "present China a more competitive and challenging opportunity",
                "explanation": "First, the correction uses the incorrect verb form: \"present\" should be changed to \"presents\" to match the subject, \"the 21st century,\" which is singular.\nThe original sentence is grammatically correct so this edit is for content and style. In terms of content, it is unusual to refer to the 21st century with the future tense \"will be,\" which refers to events that are not yet happening, because we are 23 years into the 21st century. In terms of style, the verb phrase \"present China\" is more active than \"be... for China.\" This makes the sentence more impactful and easier to understand."
            }
        ],
        "id": 440,
        "incorrect sentence": "21st century will be a more competitive and challenging opportunity for China to develop .",
        "correct sentence": "The 21st century present China a more competitive and challenging opportunity to develop ."
    },
    {
        "corrections": [
            {
                "start": 21,
                "end": 22,
                "error": "trail",
                "correct": "-",
                "explanation": "\"Trail\" means a route that someone follows or the tracks that they leave behind them. It is unclear what it means in the context of China solving its problems, so it should be deleted or edited. The sentence is saying that whether China can catch up depends on if it is capable of solving its present problems. The possessive \"China's\" requires a noun, so it should be \"ability\" plus the infinitive \"to solve.\""
            }
        ],
        "id": 443,
        "incorrect sentence": "Whether China can take this chance to catch up with those well-developed countries or even surpass them depends on China 's trail of solving the present problems .",
        "correct sentence": "Whether China can take this chance to catch up with those well-developed countries or even surpass them depends on China 's of solving the present problems ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 6,
                "error": "-",
                "correct": "an",
                "explanation": "The noun \"policy\" requires either an article or pluralization. The definite article \"the\" refers to a specific policy, especially one that was mentioned earlier in the text. Because no such policy was mentioned, it should be changed to the indefinite article \"a,\" which refers to one single unspecified policy out of multiple potential policies, or alternately to the plural \"policies,\" which means multiple unspecified policies."
            }
        ],
        "id": 446,
        "incorrect sentence": "If China can come up with effective policy to change its education system and stimulate innovation , China 's pace to flourish may become even faster .",
        "correct sentence": "If China can come up with an effective policy to change its education system and stimulate innovation , China 's pace to flourish may become even faster ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 5,
                "error": "numbers",
                "correct": "number",
                "explanation": "I disagree with this correction. This sentence is referencing how China's population explosion is causing other things to grow in number as well. Because the singular \"number\" would only refer to one thing, it should be the plural \"numbers,\" which refers to multiple things."
            },
            {
                "start": 5,
                "end": 6,
                "error": "are",
                "correct": "is",
                "explanation": "The subject is \"the numbers,\" which is plural, so for subject-verb agreement, the verb should be \"are.\""
            }
        ],
        "id": 452,
        "incorrect sentence": "Statistics show that the numbers are only continuing to grow with the existing population explosion .",
        "correct sentence": "Statistics show that the number is only continuing to grow with the existing population explosion ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 4,
                "error": "former need",
                "correct": "need of feeding millions of starving people",
                "explanation": "The adjective \"former\" can mean existing in the past, or it can refer to the first of two things mentioned. There is no mention of a past need, and the previous sentence does not refer to any needs, so neither meaning fits. Since its meaning in this sentence is unclear, it should be removed. However, the phrase \"the need\" on its own is vague. Therefore the phrase \"of feeding millions of starving people\" should be added to define what the need is."
            }
        ],
        "id": 455,
        "incorrect sentence": "If the former need is put forward to an engineer , he can view it as a broad topic with many possible solutions .",
        "correct sentence": "If the need of feeding millions of starving people is put forward to an engineer , he can view it as a broad topic with many possible solutions ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 4,
                "error": "as examples",
                "correct": "-",
                "explanation": "The word \"some\" means an unspecified amount or number, so it implies that multiple other examples exist. Therefore, \"some + (nouns)\" is often used to mean \"some (nouns), for example, are...\" Therefore, the phrase \"Some solutions as examples\" is redundant, so \"as examples\" should be deleted to be concise and clear."
            }
        ],
        "id": 458,
        "incorrect sentence": "Some solutions as examples would be to design plants/fertilizers that give higher yield or working with health experts introducing new ways to control population growth .",
        "correct sentence": "Some solutions would be to design plants/fertilizers that give higher yield or working with health experts introducing new ways to control population growth ."
    },
    {
        "corrections": [
            {
                "start": 15,
                "end": 16,
                "error": "product",
                "correct": "yield potential",
                "explanation": "The noun \"product\" means something that is the result of a process, while \"yield\" means the amount of something that is produced. The phrase \"yield potential\" refers to the yield of a plant when grown in a controlled environment. The intended meaning of this phrase is a genetically modified plant that produces greater amounts of food, and \"yield potential\" expresses this meaning most accurately."
            }
        ],
        "id": 467,
        "incorrect sentence": "He could genetically modify the plants genome to match with a plant that gives greater product or he could create a new genetic material for a higher yielding food plant .",
        "correct sentence": "He could genetically modify the plants genome to match with a plant that gives greater yield potential or he could create a new genetic material for a higher yielding food plant ."
    },
    {
        "corrections": [
            {
                "start": 52,
                "end": 53,
                "error": "if",
                "correct": "-",
                "explanation": "I agree that \"if\" needs to be corrected, but have additional edits. First, in the original sentence, the engineer needs to answer two questions: (1) which method is suitable, and (2) if that method is legal. The latter is a choice between two options: if it agrees with existing laws or if it does not. This type choice is better expressed as \"whether,\" which can indicate different choices or possibilities. Therefore, \"if\" should be changed to whether."
            }
        ],
        "id": 470,
        "incorrect sentence": "Looking at this third step we realize why the second stage of an engineering design process of gathering information is important.Once all the information is put together into the different possible solutions , the engineer is put to decide which method out of the lot is suited best for the purpose and if agrees with existing international laws .",
        "correct sentence": "Looking at this third step we realize why the second stage of an engineering design process of gathering information is important.Once all the information is put together into the different possible solutions , the engineer is put to decide which method out of the lot is suited best for the purpose and agrees with existing international laws ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 8,
                "error": "might have",
                "correct": "has",
                "explanation": "The phrase \"might have\" followed by the past participle \"been\" is used to make guesses about past events. It also expresses a strong degree of uncertainty. \"How\" can mean \"to what extent,\" so the uncertainty is already present in the phrase \"determines how accurate.\" Therefore, \"might have been\" should be changed to the present perfect \"has been,\" which indicates that a past action has effects that continue into the present. This reflects how the engineer's accuracy early in the process affects the later outcome."
            },
            {
                "start": 16,
                "end": 16,
                "error": "-",
                "correct": "has",
                "explanation": "The past tense verb \"looked\" should be changed to the present perfect \"has looked\" to match the present perfect tense earlier in the clause."
            },
            {
                "start": 21,
                "end": 22,
                "error": "considerable",
                "correct": "-",
                "explanation": "\"Considerable\" means large in size, amount, or quantity, so this sentence is confusing. It should be changed to \"significant factor\" or \"important factor\" to avoid misunderstandings."
            }
        ],
        "id": 477,
        "incorrect sentence": "This determines how accurate the engineer might have been in his work and also if he looked at nature as a considerable factor during his designing process .",
        "correct sentence": "This determines how accurate the engineer has been in his work and also if he has looked at nature as a factor during his designing process ."
    },
    {
        "corrections": [
            {
                "start": 10,
                "end": 10,
                "error": "-",
                "correct": "the most",
                "explanation": "This sentence is presenting an either-or situation, meaning that the testing stage will be one of two things. The superlative \"the most\" is used to modify the first thing, \"rewarding,\" so it should also be used for the second, \"heart-breaking.\" Without the parallel structure of using \"the most\" for both things, the sentence means \"The testing stage will either be: (1) the most rewarding stage, or (2) a heart-breaking stage.\""
            }
        ],
        "id": 480,
        "incorrect sentence": "The testing stage is usually either the most rewarding or heart- breaking stage of a design process .",
        "correct sentence": "The testing stage is usually either the most rewarding or the most heart- breaking stage of a design process ."
    },
    {
        "corrections": [
            {
                "start": 26,
                "end": 28,
                "error": "we carry",
                "correct": "-",
                "explanation": "The verb \"carry\" means to move while holding something, or to have something with you. Its meaning in the context of \"any process under the sun\" is unclear, so it should be deleted or otherwise edited."
            }
        ],
        "id": 483,
        "incorrect sentence": "Even though the solution seems perfect according to calculations , there are \" nature factors \" that we can not control which still affect any process we carry under the sun .",
        "correct sentence": "Even though the solution seems perfect according to calculations , there are \" nature factors \" that we can not control which still affect any process under the sun ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 10,
                "error": "was give",
                "correct": "with",
                "explanation": "The phrase \"was give\" is not used in English and has no meaning. It consists of a past tense verb followed by a bare infinitive, which is not grammatically correct. Instead, the phrase \"a plant with three hundred percent yield\" means \"a plant that has three hundred percent yield.\" This is because the preposition \"with\" can express the idea of having a particular characteristic. However, because the plant does not survive until harvest, it does not actually have three hundred percent yield. This should be changed to \"a plant that was supposed to have three hundred percent yield.\" This means it should have had three hundred percent yield but ultimately did not. "
            }
        ],
        "id": 486,
        "incorrect sentence": "It is likely that this genetically modified plant was give three hundred percent yield is actually not surviving until harvest .",
        "correct sentence": "It is likely that this genetically modified plant with three hundred percent yield is actually not surviving until harvest ."
    },
    {
        "corrections": [
            {
                "start": 12,
                "end": 12,
                "error": "-",
                "correct": "to",
                "explanation": "The phrase \"what the engineer would do is analyze\" uses the finite verb \"is\" followed by \"analyze,\" another bare infinitive. The infinitive verb \"analyze\" needs the preposition \"to\" in order to function as an object of the verb \"be (is)\"."
            }
        ],
        "id": 489,
        "incorrect sentence": "If that is the case , what the engineer would do is analyze the problem at hand and point out exactly which part of the solution needs to be modified .",
        "correct sentence": "If that is the case , what the engineer would do is to analyze the problem at hand and point out exactly which part of the solution needs to be modified ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 13,
                "error": "he figures",
                "correct": "is to figure",
                "explanation": "First, the phrase \"what a ….does\" is the subject of the sentence, so it needs the verb \"is\", and the complement should be followed by the verb \"is.\" Second, the verb \"is\" cannot be followed by another present tense verb, so \"figures\" should be changed to the infinitive \"to figure out,\" meaning the act of figuring out."
            },
            {
                "start": 13,
                "end": 13,
                "error": "-",
                "correct": "out",
                "explanation": "The verb \"figure\" alone means to expect or think. In order to convey the meaning of coming to understand something through a process of thought, it needs to be \"figure out.\" "
            },
            {
                "start": 17,
                "end": 18,
                "error": "introduces",
                "correct": "introduce",
                "explanation": "This is the second of two complements that follows the verb \"is.\" The verb \"is\" cannot be followed by another present tense verb, so \"introduces\" should be changed to the infinitive \"to introduce.\""
            }
        ],
        "id": 499,
        "incorrect sentence": "With the many possible solutions , what a smart engineer does he figures the best solution and introduces the best way of executing it , so that the need is fulfilled immediately and effectively .",
        "correct sentence": "With the many possible solutions , what a smart engineer does is to figure out the best solution and introduce the best way of executing it , so that the need is fulfilled immediately and effectively ."
    },
    {
        "corrections": [
            {
                "start": 16,
                "end": 17,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"innovators\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of innovators instead of to innovators in general."
            }
        ],
        "id": 502,
        "incorrect sentence": "The process of developing a new product based on innovation is not an easy task for the innovators .",
        "correct sentence": "The process of developing a new product based on innovation is not an easy task for innovators ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 2,
                "error": "The innovators",
                "correct": "Innovators",
                "explanation": "The concept of \"innovators\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of innovators instead of to innovators in general."
            },
            {
                "start": 4,
                "end": 5,
                "error": "are",
                "correct": "-",
                "explanation": "The phrase \"who are normally work\" contains two bare infinitive verbs. This is not grammatically correct, so one verb needs to be removed. If \"work\" is removed, there is potential for confusion from the phrase \"who are normally with\" because \"with\" can mean either belonging to a department or simply being together with a group. The phrase \"who normally work\" is clearer in meaning, so \"are\" should be removed."
            },
            {
                "start": 7,
                "end": 8,
                "error": "under",
                "correct": "with",
                "explanation": "The phrase \"work under\" means to work under the supervision of someone or something. The phrase \"work with\" means to work as part of a group or to work together with someone. This is closer to the intended meaning of the sentence, so \"under\" should be changed to \"with.\""
            },
            {
                "start": 8,
                "end": 8,
                "error": "-",
                "correct": "a",
                "explanation": "A department name requires an article, and the definite article \"the\" refers to a specific R&D department, especially one that was mentioned earlier, but there was no such mention. The indefinite article \"a\" is used to refer to one unspecified thing out of multiple potential options. That makes it suitable for the meaning of working in an R&D department at any company. "
            },
            {
                "start": 25,
                "end": 26,
                "error": "are",
                "correct": "and are required",
                "explanation": "First, the conjunction \"and\" is needed to connect different clauses. The clauses \"The innovators... research\" and \"are... problems\" cannot be joined with just a comma, so \"and\" needs to be added. Second, the verb \"are\" cannot be followed by \"require,\" which is also a bare infinitive. It needs the past participle \"required.\" Together, these edits clarify that the engineers need to do two things: recognize needs and spend time figuring out problems."
            },
            {
                "start": 26,
                "end": 27,
                "error": "require",
                "correct": "required",
                "explanation": "The word \"required\" appears twice in a row. This is an error, so one should be deleted."
            }
        ],
        "id": 510,
        "incorrect sentence": "The innovators , who are normally work under Research and Development department , have to recognize the needs from the public or through research , are require to spend countless days and nights to understand the problems , to produce solutions to the problems , to convert the solutions into practical products and to commercialize them .",
        "correct sentence": "Innovators , who normally work with a Research and Development department , have to recognize the needs from the public or through research , and are required required to spend countless days and nights to understand the problems , to produce solutions to the problems , to convert the solutions into practical products and to commercialize them ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 2,
                "error": "By diffusion",
                "correct": "Through distribution",
                "explanation": "This is the wrong word. \"Diffusion\" means spreading out or existing throughout an area, while \"distribution\" means the act of giving or delivering something, or the act of delivering to a business. Also, the preposition \"by\" is used to indicate a means of achieving a certain outcome, but only with gerunds. For nouns, \"through\" is used instead."
            },
            {
                "start": 15,
                "end": 16,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"innovators\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of innovators instead of to innovators in general."
            }
        ],
        "id": 514,
        "incorrect sentence": "By diffusion and adoption of the innovation products by the public or specific users , the innovators have to face the consequences .",
        "correct sentence": "Through distribution and adoption of the innovation products by the public or specific users , innovators have to face the consequences ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"innovators\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of innovators instead of to innovators in general."
            }
        ],
        "id": 517,
        "incorrect sentence": "These are not the only challenges that the innovators are going to deal with .",
        "correct sentence": "These are not the only challenges that innovators are going to deal with ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "process",
                "correct": "proceed",
                "explanation": "This is the wrong word. The verb \"process\" means to change something from one form to another, to handle something, or to take in and use something. The verb \"proceed\" means to go on to a later step, as in from the initial stage to the final stage."
            }
        ],
        "id": 520,
        "incorrect sentence": "In order to process from the initial stage of innovation development to the final stage , the most important issue is to have a huge sum of fund for development and commercial purposes .",
        "correct sentence": "In order to proceed from the initial stage of innovation development to the final stage , the most important issue is to have a huge sum of fund for development and commercial purposes ."
    },
    {
        "corrections": [
            {
                "start": 12,
                "end": 13,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"innovators\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of innovators instead of to innovators in general."
            }
        ],
        "id": 523,
        "incorrect sentence": "So , the manufacture company , for example , the company that the innovators are working for , is one of the major investors that is providing the fund .",
        "correct sentence": "So , the manufacture company , for example , the company that innovators are working for , is one of the major investors that is providing the fund ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 2,
                "error": "required",
                "correct": "require",
                "explanation": "This sentence is talking about the present, so it is inappropriate to use the past tense \"required,\" which refers to events that were already completed in the past. The present tense \"require\" should be used instead."
            },
            {
                "start": 7,
                "end": 8,
                "error": "obtain",
                "correct": "meet",
                "explanation": "The verb \"obtain\" means to acquire, and the noun \"need\" refers to something that is lacking. In this sentence, \"need\" is the object of \"obtain,\" but logically, it is not possible to obtain a lack of something. A better verb choice is \"meet,\" which means to successfully do or provide something or to reach a goal. \"Meet\" is commonly used with \"needs.\" "
            },
            {
                "start": 15,
                "end": 16,
                "error": ",",
                "correct": "-",
                "explanation": "One of the innovators' needs is hardware that will allow them to work on their prototypes. This is expressed in the phrase \"hardware equipment to work on their prototypes.\" Placing a comma between \"equipment\" and \"to\" splits the noun phrase in two, changing the meaning of the sentence. With the comma, the phrase \"to work on their prototypes\" does not modify \"hardware equipment,\" and its meaning is unclear. Therefore, the comma should be removed for clarity."
            }
        ],
        "id": 528,
        "incorrect sentence": "Innovators required development fund in order to obtain their needs , such as hardware equipments , to work on their prototypes .",
        "correct sentence": "Innovators require development fund in order to meet their needs , such as hardware equipments to work on their prototypes ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 11,
                "error": "there are some critical situations that happen",
                "correct": "critical situations can happen to",
                "explanation": "The phrase \"critical situations happen to\" is more concise and expresses the concept more clearly than the original. It also uses \"critical situations\" as the subject, which is more effective than \"there are some critical situations that can happen.\" Also, when something happens that affects a person or thing, its effect on them is reflected with the preposition \"to,\" which indicates direction. The phrase \"situations that happen the manufacturing company\" is not grammatically correct without the preposition \"to,\" so the verb should be changed to \"happen to.\""
            },
            {
                "start": 13,
                "end": 14,
                "error": "to",
                "correct": "-",
                "explanation": "The verb \"affect\" does not use a preposition. This is probably because of its roots, because it comes from the Latin ad-facere, with \"ad\" meaning at/to and \"facere\" meaning to do. Therefore, the nuance of \"to\" is already present in \"affect.\" It is not grammatical to say that something would \"affect to the manufacturing company,\" and so \"affect to\" should be changed to \"affect.\""
            },
            {
                "start": 17,
                "end": 18,
                "error": ",",
                "correct": "; then",
                "explanation": "Both \"But... company\" and \"the innovators... too\" have a subject and a verb, making them full sentences. Two full sentences cannot be joined by a comma. A semicolon should be used instead. Also, \"then,\" which shows cause and effect or the sequential order of events, should be added to show the relationship of causality between the two clauses."
            },
            {
                "start": 21,
                "end": 22,
                "error": "get",
                "correct": "need",
                "explanation": "The phrase \"get to be involved\" has a positive connotation because the phrasal verb \"get to\" means to have a chance to do something. This means it is a privilege for the innovators to be involved. If the meaning is that the innovators will become involved, it should be changed to \"then the innovators will somehow get involved too.\" This also changes the word order, because \"somehow\" should come after a verb, in this case the modal verb \"will.\""
            }
        ],
        "id": 534,
        "incorrect sentence": "But at times , there are some critical situations that happen or affect to the manufacturing company , the innovators somehow get to be involve too .",
        "correct sentence": "But at times , critical situations can happen to or affect the manufacturing company ; then the innovators somehow need to be involve too ."
    },
    {
        "corrections": [
            {
                "start": 40,
                "end": 43,
                "error": "their prototypes development",
                "correct": "the development of their prototypes",
                "explanation": "The noun phrase \"prototype development,\" using the singular \"prototype,\" means \"developing a prototype.\" However, plural nouns like \"prototypes\" generally cannot be used as the first noun in a noun phrase. Therefore, \"prototypes development\" is grammatically incorrect, and it should be changed to \"the development of their prototypes,\" wherein \"of\" indicates the object of the action \"development.\""
            }
        ],
        "id": 537,
        "incorrect sentence": "For example , if the manufacturing company did not earn profit in the market , then in order to reduce the cost and prevent the loss from getting worse , the manufacturing company has to stop funding the innovators for their prototypes development .",
        "correct sentence": "For example , if the manufacturing company did not earn profit in the market , then in order to reduce the cost and prevent the loss from getting worse , the manufacturing company has to stop funding the innovators for the development of their prototypes ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "works",
                "correct": "work",
                "explanation": "The noun \"work\" can be either countable or uncountable, but in general contexts, it is most commonly uncountable. The plural \"works\" is only used in specific contexts like public works, engineering works, etc. Outside of special cases like these, the plural is \"work.\""
            }
        ],
        "id": 540,
        "incorrect sentence": "Then the innovators have to stop all works for the development .",
        "correct sentence": "Then the innovators have to stop all work for the development ."
    },
    {
        "corrections": [
            {
                "start": 21,
                "end": 22,
                "error": "productions",
                "correct": "existing products",
                "explanation": "First, this is the wrong word. The noun \"production\" means the process of making something for sale or use. The items that result from \"manufacturing\" are called \"products,\" not \"productions.\" Second, the original sentence says that companies are slowing down two things: (1) manufacturing products and (2) releasing new products. The use of \"new\" to modify \"products\" only in (2) implies that the \"products\" in (1) and (2) are different. Therefore, another modifier, like \"existing,\" should be added to the \"products\" in (1) to clarify that manufacturing is being slowed down for existing products while release is being slowed down for new products."
            },
            {
                "start": 24,
                "end": 25,
                "error": "of",
                "correct": "-",
                "explanation": "\n\"Release\" is a transitive verb that takes a direct object, and it does not require a preposition before the direct object. Therefore, the \"of\" should be deleted."
            }
        ],
        "id": 544,
        "incorrect sentence": "For another example , during this recent economic downturn , most of the major manufacturing companies are slowing down in manufacturing productions and releasing of new products .",
        "correct sentence": "For another example , during this recent economic downturn , most of the major manufacturing companies are slowing down in manufacturing existing products and releasing new products ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"manufacturing companies\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of manufacturing companies instead of to such companies in general."
            }
        ],
        "id": 547,
        "incorrect sentence": "This shows that the manufacturing companies are trying to reduce the unnecessary burden to maintain the companies ' stand .",
        "correct sentence": "This shows that manufacturing companies are trying to reduce the unnecessary burden to maintain the companies ' stand ."
    },
    {
        "corrections": [
            {
                "start": 13,
                "end": 14,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"innovators\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of innovators instead of to innovators in general."
            }
        ],
        "id": 550,
        "incorrect sentence": "Therefore , this is one of the major factors that will definitely affect the innovators from developing innovation products .",
        "correct sentence": "Therefore , this is one of the major factors that will definitely affect innovators from developing innovation products ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"innovators\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of innovators instead of to innovators in general."
            },
            {
                "start": 8,
                "end": 9,
                "error": "concern",
                "correct": "concerned",
                "explanation": "The verb \"concern\" means to make (someone) anxious or worried, as in \"Global warming concerns me.\" In that sense, in this example, \"commercializing the final products\" (subject) concerns the \"innovators\" (object). However, when you change the object (innovators) to the subject, you should also change the structure using the phrase \"(subject) + be concerned about,\" using the past participle \"concerned\" as an adjective. This means that the innovators need to feel concerned about commercializing the products."
            },
            {
                "start": 13,
                "end": 14,
                "error": "finalize",
                "correct": "finalized",
                "explanation": "\"Finalize\" is the present tense verb or bare infinitive, so it cannot modify the noun \"products.\" This requires the past participle, \"finalized,\" which functions as an adjective. It conveys that the product was finalized in the past."
            }
        ],
        "id": 555,
        "incorrect sentence": "Another challenge that the innovators need to be concern about is commercializing the finalize products .",
        "correct sentence": "Another challenge that innovators need to be concerned about is commercializing the finalized products ."
    },
    {
        "corrections": [
            {
                "start": 9,
                "end": 10,
                "error": "how",
                "correct": "-",
                "explanation": "The word \"how\" can mean \"in what way,\" but it is only used with verb phrases like \"how the products are packed.\" The words \"packaging,\" \"marketing,\" and \"distribution\" are all nouns, so \"how\" can't be used here. Also, \"how\" adds little nuance to the sentence, so it can be removed without losing any meaning. "
            }
        ],
        "id": 558,
        "incorrect sentence": "In this final stage , it is all about how packaging , marketing and distribution of the products .",
        "correct sentence": "In this final stage , it is all about packaging , marketing and distribution of the products ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "that",
                "correct": "where",
                "explanation": "The relative pronoun \"where\" indicates the location in which something occurs. This sentence is about cases in which marketing departments don't want to market a product, so the meaning is \"situations in which,\" and therefore \"that\" should be changed to \"where.\""
            },
            {
                "start": 5,
                "end": 6,
                "error": "department",
                "correct": "departments",
                "explanation": "Department names typically require an article or pluralization. The definite article \"the\" refers to a specific marketing department, usually at a specific company. With the indefinite article \"a,\" it means a marketing department at any company, as \"a\" refers to one single unspecified thing out of multiple possibilities. This is acceptable, but for a general statement, it's preferable to use the plural \"marketing departments,\" which means the statement applies to most or all marketing departments."
            }
        ],
        "id": 562,
        "incorrect sentence": "There are cases that marketing department do not wish to market the innovated products due to various reasons .",
        "correct sentence": "There are cases where marketing departments do not wish to market the innovated products due to various reasons ."
    },
    {
        "corrections": [
            {
                "start": 9,
                "end": 10,
                "error": "innovated",
                "correct": "new",
                "explanation": "The verb \"innovate\" means to do something in a new way, and \"innovated\" is its past tense. \"Innovated\" cannot be used as a past participle adjective meaning \"having undergone innovation.\" This is commonly expressed with the adjective \"innovative\" or sometimes \"new.\""
            }
        ],
        "id": 565,
        "incorrect sentence": "For example , the marketing department thinks that the innovated products are not relevant to what the company is selling .",
        "correct sentence": "For example , the marketing department thinks that the new products are not relevant to what the company is selling ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "innovated",
                "correct": "new",
                "explanation": "The verb \"innovate\" means to do something in a new way, and \"innovated\" is its past tense. \"Innovated\" cannot be used as a past participle adjective meaning \"having undergone innovation.\" This is commonly expressed with the adjective \"innovative\" or sometimes \"new.\""
            },
            {
                "start": 8,
                "end": 9,
                "error": "meet",
                "correct": "reach",
                "explanation": "Depending on the meaning, I may not agree with this connection. The verb \"meet\" means to see or encounter someone, and it is not commonly used for inanimate objects like products. If it means that the products are unable to make their way to consumers, it should be \"reach,\" which means to arrive at a destination. If it means to fulfill the needs of consumers, then the word \"need\" is missing and it should be changed to \"meet the consumers' needs,\" with the possessive apostrophe on \"consumers'\" to indicate belonging."
            }
        ],
        "id": 569,
        "incorrect sentence": "Therefore , the innovated products are unable to meet the consumers .",
        "correct sentence": "Therefore , the new products are unable to reach the consumers ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 3,
                "error": "-",
                "correct": "that",
                "explanation": "Another example\" is the subject, the verb is \"is,\" and \"the marketing...\" is a noun clause functioning as the complement. It provides more information about the subject. The usage of \"that\" makes the sentence clearer to introduce the clause that follows so it does not become a run-on sentence."
            },
            {
                "start": 12,
                "end": 13,
                "error": "innovated",
                "correct": "new",
                "explanation": "The verb \"innovate\" means to do something in a new way, and \"innovated\" is its past tense. \"Innovated\" cannot be used as a past participle adjective meaning \"having undergone innovation.\" This is commonly expressed with the adjective \"innovative\" or sometimes \"new.\""
            },
            {
                "start": 19,
                "end": 21,
                "error": "they fail",
                "correct": "it fails",
                "explanation": "The pronoun \"they\" or \"it\" refers to \"the marketing department,\" which can be used as a collective noun and treated as singular. Therefore, the pronoun should be the singular \"it\" and the verb should be \"fails\" for subject-verb agreement."
            },
            {
                "start": 27,
                "end": 28,
                "error": "the",
                "correct": "-",
                "explanation": "\"Selling\" is a gerund, and gerunds do not take an article when referring to the act of selling in general. Gerunds only take an article when referring to a specific instance of the action, so \"the\" should be deleted."
            },
            {
                "start": 30,
                "end": 31,
                "error": "innovated",
                "correct": "new",
                "explanation": "The verb \"innovate\" means to do something in a new way, and \"innovated\" is its past tense. \"Innovated\" cannot be used as a past participle adjective meaning \"having undergone innovation.\" This is commonly expressed with the adjective \"innovative\" or sometimes \"new.\""
            }
        ],
        "id": 576,
        "incorrect sentence": "Another example is the marketing department has set the price of the innovated product too high ; therefore , they fail to obtain the sales target for the selling the innovated product .",
        "correct sentence": "Another example is that the marketing department has set the price of the new product too high ; therefore , it fails to obtain the sales target for selling the new product ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 9,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"innovators\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of innovators instead of to innovators in general."
            },
            {
                "start": 12,
                "end": 13,
                "error": "face",
                "correct": "consider",
                "explanation": "This is the wrong word. The verb \"face\" means to confront an unpleasant situation or possibility. It is mainly used with problems. The verb \"consider\" means to think carefully about or to take into account in a judgment. A \"factor\" is not inherently a problem. Rather, it is a condition or aspect to be included in a judgment or calculation. That makes \"consider\" a better choice for \"factor.\""
            }
        ],
        "id": 580,
        "incorrect sentence": "So , this is another major factor that the innovators have to face .",
        "correct sentence": "So , this is another major factor that innovators have to consider ."
    },
    {
        "corrections": [
            {
                "start": 14,
                "end": 15,
                "error": "the",
                "correct": "new",
                "explanation": "The phrase \"the products\" refers to a specific category of products, as the definite article \"the\" refers to a specific product, particularly one that has been mentioned before. In this case, these products have not been mentioned yet, but they are a specific category: products characterized by newness. This is the first mention of this group of products, so \"new products\" is appropriate. For the second mention onward, the definite article \"the\" should be added."
            }
        ],
        "id": 583,
        "incorrect sentence": "In brief , innovators have to face many challenges when they want to develop the products .",
        "correct sentence": "In brief , innovators have to face many challenges when they want to develop new products ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"investors\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of investors instead of to investors in general."
            }
        ],
        "id": 586,
        "incorrect sentence": "They have to obtain fund from the investors in order to develop their innovation prototypes and require help from the marketing department to have their innovation products for sales in the marketplace .",
        "correct sentence": "They have to obtain fund from investors in order to develop their innovation prototypes and require help from the marketing department to have their innovation products for sales in the marketplace ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "challenges",
                "correct": "challenge",
                "explanation": "The pronoun \"another\" means \"one more,\" so it is singular and cannot be used with the plural \"challenges.\" The singular \"challenge\" should be used instead."
            }
        ],
        "id": 589,
        "incorrect sentence": "However , these procedures might become another challenges for the innovators .",
        "correct sentence": "However , these procedures might become another challenge for the innovators ."
    },
    {
        "corrections": [
            {
                "start": 16,
                "end": 17,
                "error": "satisfies",
                "correct": "satisfy",
                "explanation": "The subject is \"representations,\" which is plural, so the verb form should be changed to \"satisfy\" for subject-verb agreement."
            }
        ],
        "id": 593,
        "incorrect sentence": "Engineering design is defined as a process that brings ideas or theories into physical representations which satisfies human needs .",
        "correct sentence": "Engineering design is defined as a process that brings ideas or theories into physical representations which satisfy human needs ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 2,
                "error": "Engineering",
                "correct": "engineering",
                "explanation": "English only capitalizes proper nouns and the first word of a sentence. Because \"engineering\" is a common noun and it appears mid-sentence, it should not be capitalized."
            },
            {
                "start": 8,
                "end": 9,
                "error": "problem",
                "correct": "problems",
                "explanation": "In this sentence, \"problems\" corresponds with \"engineering designs,\" which is plural. In most cases, two related nouns/noun phrases like these should share the same ending, so \"problems\" should be pluralized. Also, in reality, most engineering designs are produced with multiple problems in mind, rather than one problem as implied by the singular \"problem,\" so this is also more accurate."
            }
        ],
        "id": 598,
        "incorrect sentence": "Because Engineering designs are always related to real problem , during the five processes , the obstacles they face are more than theories and calculations on paper .",
        "correct sentence": "Because engineering designs are always related to real problems , during the five processes , the obstacles they face are more than theories and calculations on paper ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 5,
                "error": "realized",
                "correct": "relevant",
                "explanation": "I agree that \"realized\" needs to be changed. The verb \"realize\" means to become real or make real, and it does not have the nuance of acknowledgement or understanding. \"Relevant\" means connected or appropriate to a certain topic. It is better to say \"recognized,\" meaning that their existence or significance is acknowledged."
            }
        ],
        "id": 603,
        "incorrect sentence": "Political issues usually become realized in the beginning and final steps , especially in the last step .",
        "correct sentence": "Political issues usually become relevant in the beginning and final steps , especially in the last step ."
    },
    {
        "corrections": [
            {
                "start": 28,
                "end": 28,
                "error": "-",
                "correct": "thus",
                "explanation": "Without \"thus,\" both \"to minimize the time... handling problems\" and \"forces... provides\" can both be the object of the verb \"want\" providing more information, but that is probably not true. It is more likely that the government wants to minimize the time spent on problems, which results in engineers being forced to skip steps. This relationship of causality is shown by the adverb \"thus,\" meaning \"by so doing\" or \"in this way.\" "
            },
            {
                "start": 28,
                "end": 29,
                "error": "force",
                "correct": "forces",
                "explanation": "The subject of the verb is \"the government,\" which is singular, so the verb should be changed from \"force\" to \"forces\" for subject-verb agreement."
            }
        ],
        "id": 609,
        "incorrect sentence": "However , in some cities of China , the government wants to minimize the time spending on problem solving process to show their ability in handling problems and force the engineers to skip the first step or just accept the information the government provides .",
        "correct sentence": "However , in some cities of China , the government wants to minimize the time spending on problem solving process to show their ability in handling problems and thus forces the engineers to skip the first step or just accept the information the government provides ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 2,
                "error": "And in",
                "correct": "In",
                "explanation": "A sentence can begin with the conjunction \"and\" in informal speech, but not in formal, written English. Therefore, \"And\" should be removed."
            },
            {
                "start": 9,
                "end": 9,
                "error": "-",
                "correct": "out",
                "explanation": "The verb \"turn\" alone means to move around a central point, or to face a different direction. To convey the idea of eventually becoming something or being found to have a particular quality, it needs to be changed to the phrasal verb \"turn out.\""
            }
        ],
        "id": 613,
        "incorrect sentence": "And in the end such a design may turn to be useless as it does not meet people 's demand .",
        "correct sentence": "In the end such a design may turn out to be useless as it does not meet people 's demand ."
    },
    {
        "corrections": [
            {
                "start": 9,
                "end": 9,
                "error": "-",
                "correct": "can",
                "explanation": "Without \"can,\" it sounds like political issues always or almost always disturb the process. The reality is that this does not always happen, so \"can\" should be added to indicate that there is the potential for it to happen."
            },
            {
                "start": 10,
                "end": 11,
                "error": "disturb",
                "correct": "disrupt",
                "explanation": "The verb \"disturb\" refers to interrupting or bothering someone, or to cause a change in position or arrangement. The better choice is the verb \"disrupt,\" which means to cause something to be unable to continue in the normal manner. "
            }
        ],
        "id": 617,
        "incorrect sentence": "In the last step of design , political issues also disturb the process significantly .",
        "correct sentence": "In the last step of design , political issues can also disrupt the process significantly ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 3,
                "error": "when",
                "correct": "after",
                "explanation": "The conjunction \"when\" means at or during a specific time, while \"after\" means later than a specific time. The intended meaning is that the design was carried out for a few weeks and then was stopped. \"When\" means it was stopped during the first few weeks, while \"after\" means that a few weeks passed and then it was stopped. The distinction is subtle, but \"after\" is used more commonly in this context than \"when.\" "
            }
        ],
        "id": 622,
        "incorrect sentence": "However , when the design had been carried out for a few weeks , it was stopped .",
        "correct sentence": "However , after the design had been carried out for a few weeks , it was stopped ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 7,
                "error": "because of",
                "correct": "-",
                "explanation": "The phrase \"because of\" modifies the word that comes immediately before it. Here, that word is \"explanation,\" so the sentence is interpreted to mean that the government gave the explanation because of safety considerations. This is not the case, so \"because of\" should be deleted. The phrase \"the government's explanation was safety consideration\" on its own means that the government said that safety considerations were the reason."
            }
        ],
        "id": 625,
        "incorrect sentence": "The government 's explanation was because of safety consideration for earthquakes and some other disasters .",
        "correct sentence": "The government 's explanation was safety consideration for earthquakes and some other disasters ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 2,
                "error": "-",
                "correct": "an",
                "explanation": "I partially agree with this correction. When \"such\" modifies a noun, it generally takes the indefinite article \"a\" or \"an\" except in special cases. \"A\" is used when the next word begins with a consonant and \"an\" when it begins with a vowel. \"Possibility\" begins with a consonant, so it should be \"a.\" This also makes it easier to pronounce."
            },
            {
                "start": 4,
                "end": 5,
                "error": "of",
                "correct": "-",
                "explanation": "The word \"nonsense\" is a noun, so it does not need the preposition \"of\" to be the object of \"explanation.\" The phrase \"the explanation was nonsense\" is grammatically correct, and it means that the explanation was nonsensical."
            },
            {
                "start": 13,
                "end": 13,
                "error": "-",
                "correct": "a",
                "explanation": "The indefinite article \"a\" indicates that the \"possibility\" has a particular quality or that the possibility is one of many possible options."
            }
        ],
        "id": 630,
        "incorrect sentence": "But such explanation was of non-sense as the engineers did not see such possibility during their designing ; otherwise the design would not be carried out at all .",
        "correct sentence": "But such an explanation was non-sense as the engineers did not see such a possibility during their designing ; otherwise the design would not be carried out at all ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "of",
                "correct": "for",
                "explanation": "The phrase \"the reason for\" is a collocation, and \"that the reason of\" is not used. The preposition \"for\" can indicate why something is done. This sentence is explaining the reason that work stopped, so \"for\" is used to indicate that the cause of the stoppage was that the authorities thought a traffic system was not necessary."
            },
            {
                "start": 7,
                "end": 7,
                "error": "-",
                "correct": "the",
                "explanation": "The definite article \"the\" is used when referring to a specific instance of an action. This sentence is referring to a specific incident where work was stopped on a specific engineering project, so the definite article is necessary."
            },
            {
                "start": 9,
                "end": 9,
                "error": "-",
                "correct": "the",
                "explanation": "The definite article \"the\" is used when referring to a specific thing. This sentence is referring to a specific engineering project where work was stopped, so the definite article is necessary."
            },
            {
                "start": 15,
                "end": 16,
                "error": "of",
                "correct": "-",
                "explanation": "The phrase \"high level of\" refers to the physical levels or floors of an object or structure. Without the preposition \"of,\" the compound adjective \"high-level\" means top ranking or of great importance. Therefore, the preposition \"of\" should be removed to convey that the authorities were of high rank."
            }
        ],
        "id": 636,
        "incorrect sentence": "Some evidences showed that the reason of halt of work was that the higher level of authorities thought an underground traffic system was not necessary for Harbin .",
        "correct sentence": "Some evidences showed that the reason for the halt of the work was that the higher level authorities thought an underground traffic system was not necessary for Harbin ."
    },
    {
        "corrections": [
            {
                "start": 26,
                "end": 27,
                "error": "inconsistent",
                "correct": "inconsistency",
                "explanation": "\"Inconsistent\" is an adjective, and \"inconsistency\" is a noun. The phrase \"due to\" is used with nouns, so it should be changed to the noun form \"consistency.\""
            }
        ],
        "id": 639,
        "incorrect sentence": "In this example , there is nothing wrong with the original design work , but the design still can not be carried out due to political inconsistent between the city government and higher level authorities .",
        "correct sentence": "In this example , there is nothing wrong with the original design work , but the design still can not be carried out due to political inconsistency between the city government and higher level authorities ."
    },
    {
        "corrections": [
            {
                "start": 22,
                "end": 23,
                "error": ",",
                "correct": ";",
                "explanation": "Both \"The similarities... engineering group\" and \"in other words... to some degree\" have a subject and a verb, making them both full sentences. Two full sentences cannot be joined by a comma. A semicolon should be used instead."
            }
        ],
        "id": 642,
        "incorrect sentence": "The similarities of political obstacles in both two steps are that such problems can not be easily solved by the engineering group , in other words , the political problems are unavoidable to some degree .",
        "correct sentence": "The similarities of political obstacles in both two steps are that such problems can not be easily solved by the engineering group ; in other words , the political problems are unavoidable to some degree ."
    },
    {
        "corrections": [
            {
                "start": 10,
                "end": 10,
                "error": "-",
                "correct": "the",
                "explanation": "The definite article “the” refers to a specific design process that has already been mentioned, and \"another\" implies the existence of other processes than that one. \"The\" marks “the design process” as being distinct from those other processes."
            }
        ],
        "id": 645,
        "incorrect sentence": "Another problem , financial issue , is quite common during design process .",
        "correct sentence": "Another problem , financial issue , is quite common during the design process ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 5,
                "error": "-",
                "correct": "the",
                "explanation": "I don't think the corrected sentence is correct. The adjective phrase \"the analyzing and testing\" does not require another \"the,\" and it is redundant to say \"the analyzing and the testing step.\""
            },
            {
                "start": 5,
                "end": 6,
                "error": "test",
                "correct": "testing",
                "explanation": "The noun \"test\" means experiment or study, whereas the gerund \"testing\" refers to subjecting something to a test or series of tests. \"Testing\" is also more commonly used when discussing the steps of the manufacturing process."
            }
        ],
        "id": 649,
        "incorrect sentence": "It affects the analyzing and test step most seriously though it can affect almost every step of design work .",
        "correct sentence": "It affects the analyzing and the testing step most seriously though it can affect almost every step of design work ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"engineers\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of engineers instead of to engineers in general."
            },
            {
                "start": 8,
                "end": 9,
                "error": "always",
                "correct": "usually",
                "explanation": "The adverb \"always\" means at all times or in every case. Many engineers are employed by companies, but there are exceptions, so it is not always the case. Therefore, the adverb \"usually\" is a better choice because it describes what happens most of the time or in most cases."
            }
        ],
        "id": 653,
        "incorrect sentence": "For most design work , the engineers are always employed by some organizations or companies .",
        "correct sentence": "For most design work , engineers are usually employed by some organizations or companies ."
    },
    {
        "corrections": [
            {
                "start": 19,
                "end": 20,
                "error": "incomplete",
                "correct": "incompletion",
                "explanation": "The adjective \"incomplete\" cannot be used in the structure \"the X of a project, \" as this structure requires a noun. However, the noun \"incompletion\" is a very uncommon word that may not be understood, so this correction does not fix the issue. It is more common to say \"the failure to complete a project\" or \"a project being left incomplete.\""
            }
        ],
        "id": 660,
        "incorrect sentence": "Besides , the lack of financial support or sudden stop in the financial support may even lead to the incomplete of a project .",
        "correct sentence": "Besides , the lack of financial support or sudden stop in the financial support may even lead to the incompletion of a project ."
    },
    {
        "corrections": [
            {
                "start": 13,
                "end": 13,
                "error": "-",
                "correct": "is",
                "explanation": "Without the verb \"is,\" the phrase \"more common around the world\" is connected to the earlier verb \"affects,\" as in \"The financial problem affects more common around the world.\" This sentence has no meaning. \"Affects\" should apply only to the phrase \"more steps\" and \"more common around the world\" needs its own verb. Because the subject \"the financial problem\" is a noun and \"common\" is an adjective, the verb should be \"is,\" so the sentence means that financial problems are more common than political issues."
            }
        ],
        "id": 665,
        "incorrect sentence": "Compared to the political issues , the financial problem affects more steps and more common around the world .",
        "correct sentence": "Compared to the political issues , the financial problem affects more steps and is more common around the world ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 4,
                "error": "of these two",
                "correct": "these",
                "explanation": "This is a stylistic edit and not a grammatical one. The phrase \"both of these two\" is grammatically correct but unnecessarily wordy. \"Both these problems\" conveys the same information more concisely and with less possibility for confusion."
            },
            {
                "start": 15,
                "end": 16,
                "error": "completely",
                "correct": "complete",
                "explanation": "\"Completely\" is an adverb to modify verbs, while \"complete\" is an adjective to modify nouns. Since \"Failure\" is a noun, the adjective \"complete\" should be used."
            }
        ],
        "id": 671,
        "incorrect sentence": "Both of these two problems , though affecting different processes , can lead to a completely failure of a project .",
        "correct sentence": "Both these problems , though affecting different processes , can lead to a complete failure of a project ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 11,
                "error": "-",
                "correct": "a",
                "explanation": "The indefinite article \"a\" is used when something exists in an unspecified manner or amount, or to express one out of multiple options. The phrase \"comfortable and easier life\" means one potential lifestyle out of many, with varying potential degrees of comfort and ease. This condition is best expressed by the indefinite article \"a.\""
            }
        ],
        "id": 677,
        "incorrect sentence": "Humankind always has needs and demands because people want to lead more comfortable and easier life .",
        "correct sentence": "Humankind always has needs and demands because people want to lead a more comfortable and easier life ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 4,
                "error": "-",
                "correct": "in",
                "explanation": "In this context, the area of involvement is \"various fields,\" in other words, \"engineering is involved in various field\", but in the incorrect sentence, there is no preposition to link it to the subject \"engineering.\" Therefore, it should be changed to \"various fields in which.\""
            }
        ],
        "id": 682,
        "incorrect sentence": "There are various fields which engineering plays an important role in our daily lives , such as entertainment , healthcare , transportation , real estate , and so on .",
        "correct sentence": "There are various fields in which engineering plays an important role in our daily lives , such as entertainment , healthcare , transportation , real estate , and so on ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 7,
                "error": "As what Khandani ( 2005 ) said",
                "correct": "According to Khandani ( 2005 )",
                "explanation": "I agree that the sentence should be corrected but would make a different edit. The phrase \"As what Khandani (2005) said\" is not grammatically correct. The correct wording when citing an idea is \"As Khandani (2005) said\", or, more academically, \"As Khandani (2005) describes.\""
            }
        ],
        "id": 685,
        "incorrect sentence": "As what Khandani ( 2005 ) said , a company 's survival depends on whether its products are in high demand by the society or not .",
        "correct sentence": "According to Khandani ( 2005 ) , a company 's survival depends on whether its products are in high demand by the society or not ."
    },
    {
        "corrections": [
            {
                "start": 36,
                "end": 38,
                "error": "most demanded",
                "correct": "in greatest demand",
                "explanation": "When talking about demand in the context of commerce or the market, it is common to use the noun phrase \"in demand\" rather than the verb \"demand.\" The verb means to say or ask for something in a forceful way. It commonly refers to the actions of a person or to a situation, but not to the needs or wants of the market. Also, while the superlative \"most demanded\" is correct for the verb \"demand,\" it should be \"in greatest demand\" for the noun phrase \"in demand.\" The phrase \"most in demand\" is also grammatically correct, but it is not often used. Also, the phrase \"interested to (verb)\" is not commonly used. The common construction is \"interested in (verbing),\" so it should be changed from the bare infinitive \"invent\" to the gerund \"inventing,\" which refers to the process of inventing."
            }
        ],
        "id": 688,
        "incorrect sentence": "Most companies are more interested to invent entertainment electronic goods such as flat LCD screens , smaller and smaller mp3/mp4 players , touch screen hand phones , more portable laptops , and so on which are most demanded in the market .",
        "correct sentence": "Most companies are more interested to invent entertainment electronic goods such as flat LCD screens , smaller and smaller mp3/mp4 players , touch screen hand phones , more portable laptops , and so on which are in greatest demand in the market ."
    },
    {
        "corrections": [
            {
                "start": 15,
                "end": 15,
                "error": "-",
                "correct": "of",
                "explanation": "The phrase \"one of the most\" is an idiomatic phrase, and it always requires the preposition \"of.\" It means that prosthetic limbs are on the highest tier of importance. The preposition \"of\" is essential because it indicates that the phrase \"prosthetic limbs\" belongs to a group of things: \"healthcare products on the market.\""
            }
        ],
        "id": 696,
        "incorrect sentence": "Among quite a number of healthcare products available in market , prosthetic limbs play one the most important roles .",
        "correct sentence": "Among quite a number of healthcare products available in market , prosthetic limbs play one of the most important roles ."
    },
    {
        "corrections": [
            {
                "start": 13,
                "end": 15,
                "error": "because of",
                "correct": "-",
                "explanation": "The conjunction \"because\" means \"for the reason that,\" and that meaning is already present in the phrase \"for various reasons.\" Therefore, \"because\" is redundant and should be deleted."
            }
        ],
        "id": 700,
        "incorrect sentence": "They are needed for various reasons , including congenital defects , accidents or because of some diseases .",
        "correct sentence": "They are needed for various reasons , including congenital defects , accidents or some diseases ."
    },
    {
        "corrections": [
            {
                "start": 21,
                "end": 21,
                "error": "-",
                "correct": ",",
                "explanation": "A comma is always needed before a non-restrictive clause. A non-restrictive clause is a clause that adds additional information to the sentence and that can be removed. The phrase \"According to... design processes,\" is a full sentence on its own, making the phrase \"which are... implementing it\" a non-restrictive clause, so it requires a comma."
            }
        ],
        "id": 707,
        "incorrect sentence": "According to Khandani ( 2005 ) ,to design an efficient and safe artificial limb may usually need five basic design processes which are defining the problem , gathering pertinent information , generating possible solutions , analyzing and selecting the best possible solution and finally testing and implementing it .",
        "correct sentence": "According to Khandani ( 2005 ) ,to design an efficient and safe artificial limb may usually need five basic design processes , which are defining the problem , gathering pertinent information , generating possible solutions , analyzing and selecting the best possible solution and finally testing and implementing it ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "that",
                "correct": "of",
                "explanation": "\"How\" and \"that\" are both conjunctions, so they cannot be used in succession. It is acceptable to say either \"This is proof that a successful design can...\" or \"This is proof of how a successful design can...\" but it is ungrammatical and redundant to mix them."
            }
        ],
        "id": 719,
        "incorrect sentence": "\" This is the proof that how a successful design can be beneficial to a needy person .",
        "correct sentence": "\" This is the proof of how a successful design can be beneficial to a needy person ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 1,
                "error": "Government",
                "correct": "Governments",
                "explanation": "The noun \"government\" requires either an article or pluralization. The definite article \"the\" refers to a specific government, such as that of a specific country or municipality. The indefinite article \"a\" means any government anywhere, as it refers to one single unspecified option out of multiple possibilities. The plural \"governments\" refers to most or all governments, so it is the best choice for a general statement like this one."
            },
            {
                "start": 3,
                "end": 5,
                "error": "more encouraging",
                "correct": "encourage more",
                "explanation": "The auxiliary verb \"should\" needs to be followed by the bare infinitive, so \"encouraging\" should be changed to \"encourage.\" Also, the correct position of \"more\" depends on the part of speech. \"More\" comes before adjectives or gerunds but after verbs. \"Encouraging\" is a present participle that is functioning as an adjective, so it should be changed to \"encourage more.\""
            }
        ],
        "id": 724,
        "incorrect sentence": "Government should also more encouraging the research and development of these products .",
        "correct sentence": "Governments should also encourage more the research and development of these products ."
    },
    {
        "corrections": [
            {
                "start": 13,
                "end": 13,
                "error": "-",
                "correct": "the",
                "explanation": "The noun phrase \"the year XXXX\" always uses the definite article \"the.\" This is because the definite article is used to refer to a particular unit or period of time. The year 2009 only occurred once, so it is a specific, definite thing, and so the article should be used. Also, the definite article was used in the phrase \"the year 2003,\" and because of parallel structure, similar phrases should match in terms of article or pluralization as a general rule."
            }
        ],
        "id": 731,
        "incorrect sentence": "The cost of raw materials has risen significantly from the year 2003 to year 2009 and it has affected the electronics supply chain .",
        "correct sentence": "The cost of raw materials has risen significantly from the year 2003 to the year 2009 and it has affected the electronics supply chain ."
    },
    {
        "corrections": [
            {
                "start": 41,
                "end": 41,
                "error": "-",
                "correct": "is",
                "explanation": "The verb \"is\" is already used earlier in the sentence, but it must be repeated because the two phrases that it precedes serve different functions. In the first phrase, \"gold\" is the subject and the verb \"is\" states an attribute or defining characteristic of gold: that it is important in electrical conductivity. In the second phrase, the \"is\" is part of a passive voice construction, which is used to convey what is done to an object by an actor. The passive voice verb consists of a form of the verb \"to be\" plus the past participle. In this sentence, \"gold\" is the object of the passive verb phrase \"is used,\" meaning that an unmentioned actor makes use of gold in contact points. The passive voice cannot be formed without \"is,\" so it must be added."
            }
        ],
        "id": 735,
        "incorrect sentence": "The price of gold has risen from about US $ 380/troy ounce in June 2003 to about US $ 960/troy ounce in June 2009 ( \" Trend \" ) .1 Gold is a very important component in electrical conductivity and thus often used in contact points such as the communicating interface between the graphics card and the motherboard .",
        "correct sentence": "The price of gold has risen from about US $ 380/troy ounce in June 2003 to about US $ 960/troy ounce in June 2009 ( \" Trend \" ) .1 Gold is a very important component in electrical conductivity and thus is often used in contact points such as the communicating interface between the graphics card and the motherboard ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 4,
                "error": "-",
                "correct": "a",
                "explanation": "The indefinite article \"a\" is used when something exists in an unspecified or unknown manner or amount. The phrase \"large amount of gold\" refers to a great deal of gold, but the exact amount is unstated. This condition is best expressed by the indefinite article \"a.\""
            }
        ],
        "id": 738,
        "incorrect sentence": "Hence designs that need large amount of gold may not be feasible .",
        "correct sentence": "Hence designs that need a large amount of gold may not be feasible ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "were",
                "correct": "are",
                "explanation": "This sentence is in the present tense, so it is inappropriate to use the past tense \"were,\" which refers to events that were completed in the past. The present tense \"is\" should be used instead."
            }
        ],
        "id": 746,
        "incorrect sentence": "However , if the engineers were to stick to their original design , the cost of the end product will be high .",
        "correct sentence": "However , if the engineers are to stick to their original design , the cost of the end product will be high ."
    },
    {
        "corrections": [
            {
                "start": 23,
                "end": 24,
                "error": "come",
                "correct": "comes",
                "explanation": "The subject is \"he/she,\" which is singular, so the verb should be singular for subject-verb agreement."
            }
        ],
        "id": 753,
        "incorrect sentence": "When electronic devices are not grounded properly , there is a probability that the user might get an electric shock when he/she accidentally come into contact with the device .",
        "correct sentence": "When electronic devices are not grounded properly , there is a probability that the user might get an electric shock when he/she accidentally comes into contact with the device ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "cases",
                "correct": "case",
                "explanation": "This sentence is introducing one relevant case, as shown in the singular phrase \"Another example.\" Therefore, the singular \"case\" should be used instead of the plural \"cases.\""
            }
        ],
        "id": 757,
        "incorrect sentence": "Another example would be the cases of Apple 's iPhone .",
        "correct sentence": "Another example would be the case of Apple 's iPhone ."
    },
    {
        "corrections": [
            {
                "start": 15,
                "end": 16,
                "error": "iPhone",
                "correct": "iPhones",
                "explanation": "The noun \"iPhone(s)\" is modified by the possessive \"users',\" which is plural. Typically, a smartphone belongs to one person, not to multiple people, so if the subject is a group of multiple people, presumably each would have their own phone, so multiple phones would be present."
            }
        ],
        "id": 760,
        "incorrect sentence": "There are many reports around the internet and on newspaper stating that some users ' iPhone exploded and the main cause is due to the overheating of the lithium- ion battery .",
        "correct sentence": "There are many reports around the internet and on newspaper stating that some users ' iPhones exploded and the main cause is due to the overheating of the lithium- ion battery ."
    },
    {
        "corrections": [
            {
                "start": 20,
                "end": 27,
                "error": "and in the worst case scenario ;",
                "correct": ". In the worst case scenario ,",
                "explanation": "This statement consists of two complete sentences: \"Lithium-ion... unsafe for use,\" and \"in the worst case... to the user.\" They are joined by the conjunction \"and\" without a comma, but joining two full sentences requires a comma before the conjunction. The sentence could be fixed with a comma before \"and,\" but the argument is more powerful when it is divided into two sentences. Shorter sentences are easier to understand, and dividing before \"in the worst case scenario\" emphasizes the phrase, prompting the reader to pay more attention to the potential outcome: \"injury or death.\""
            }
        ],
        "id": 763,
        "incorrect sentence": "Lithium-ion battery has a temperature tolerance of about 60OC and anything above that will make the battery unsafe for use and in the worst case scenario ; the battery explodes , causing injury or death to the user .",
        "correct sentence": "Lithium-ion battery has a temperature tolerance of about 60OC and anything above that will make the battery unsafe for use . In the worst case scenario , the battery explodes , causing injury or death to the user ."
    },
    {
        "corrections": [
            {
                "start": 1,
                "end": 2,
                "error": "product",
                "correct": "products",
                "explanation": "When referencing products as a general concept, the plural \"products\" should be used because it means multiple products. The singular \"product\" is used to refer to an individual product, with \"a product\" meaning any product and \"the product\" meaning one specific product."
            }
        ],
        "id": 766,
        "incorrect sentence": "Hazardous product can tarnish the reputation of the company and sometimes even result in the loss of innocent lives .",
        "correct sentence": "Hazardous products can tarnish the reputation of the company and sometimes even result in the loss of innocent lives ."
    },
    {
        "corrections": [
            {
                "start": 11,
                "end": 12,
                "error": "test",
                "correct": "tests",
                "explanation": "The noun phrase \"trial tests\" is modified by the adjective \"repeated,\" meaning performed or occurring multiple times in the same way. This concept necessitates a plural because an action performed multiple times is not considered singular. "
            }
        ],
        "id": 769,
        "incorrect sentence": "Thus it is very important for engineers to do repeated trial test of the product to ensure that it is free of faults .",
        "correct sentence": "Thus it is very important for engineers to do repeated trial tests of the product to ensure that it is free of faults ."
    },
    {
        "corrections": [
            {
                "start": 8,
                "end": 10,
                "error": "must be",
                "correct": "is",
                "explanation": "The word \"must\" is already present in the phrase \"must ensure that.\" It is redundant to include it again, so it is not common to do so."
            },
            {
                "start": 26,
                "end": 33,
                "error": ", it may even injure or kill",
                "correct": "but even injuring or killing",
                "explanation": "First, both \"Lastly,... company\" and \"it may... someone\" have a subject and a verb, making them both full sentences. Full sentences cannot be connected by a comma alone. This requires a correlative conjunction, like \"not only... but.\" Also, the pronoun \"it\" does not need to be restated, so it can be removed. Second, the phrase \"may even\" is not grammatically incorrect, but just \"even\" can express the same idea more concisely and with greater certainty. Greater certainty strengthens the author's argument, so \"may\" should be removed. Finally, the \"not only... but\" construction applies to two phrases, both of which must be the same part of speech. The first is the gerund \"spoiling,\" so the second should be changed from the bare infinitive \"injure\" to the gerund \"injuring.\""
            }
        ],
        "id": 775,
        "incorrect sentence": "Lastly , engineers must ensure that the product must be safe to use or it will end up not only spoiling the reputation of the company , it may even injure or kill someone .",
        "correct sentence": "Lastly , engineers must ensure that the product is safe to use or it will end up not only spoiling the reputation of the company but even injuring or killing someone ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 1,
                "error": "Engineering",
                "correct": "The engineering",
                "explanation": "The definite article “the” can imply a comparison. The phrase “the engineering process” implies the existence of other processes, such as the development process or the design process, and marks “the engineering process” as being distinct from those other processes."
            },
            {
                "start": 9,
                "end": 10,
                "error": "fused",
                "correct": "-",
                "explanation": "The verb \"fuse\" means to combine or to join together. Its meaning and its connection to the engineering design process are unclear, so it should be deleted."
            },
            {
                "start": 28,
                "end": 29,
                "error": "on",
                "correct": "-",
                "explanation": "I don't agree with this correction because it does not fix the problem. As a noun, \"current\" means electrical or water currents, or an idea that is shared by a group. It cannot be used alone to mean \"the current process.\" I think the author intended to write \"the current one,\" meaning \"the current process,\" but made a spelling error. The correct way to fix this is to change \"on\" to \"one.\""
            },
            {
                "start": 32,
                "end": 34,
                "error": "desired deeds",
                "correct": "-",
                "explanation": "I don't agree with this correction because it does not fix the problem and it creates a grammatically unsound sentence. The verb \"cater to\" requires an object, which here is \"desired deeds.\" Removing the object destroys the meaning of the whole phrase. While it's true that the meaning of the phrase \"desired deeds\" is unclear, it cannot be removed entirely and so it should be changed to something like \"what others desire.\""
            }
        ],
        "id": 784,
        "incorrect sentence": "Engineering design process can be defined as a process fused by fellow engineers in the aid of developing either an entirely new system or improvising on the current on to cater to desired deeds .",
        "correct sentence": "The engineering design process can be defined as a process by fellow engineers in the aid of developing either an entirely new system or improvising on the current to cater to ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 6,
                "error": "-",
                "correct": "as",
                "explanation": "The verb \"see\" alone just means to notice or become aware of something by visual means. It does not convey the idea of how something is perceived or considered. For this, it needs the preposition \"as,\" which is used to indicate how a person or thing appears or is thought of."
            },
            {
                "start": 7,
                "end": 10,
                "error": "as part of",
                "correct": "to",
                "explanation": "I would edit this differently. The phrase \"Indispensable as part of\" does not convey that the process is considered indispensable due to its role in economic growth. There's also a possibility of confusion because \"as\" is used in both \"seen as indispensable\" and \"as part of.\" The proposed correction, using the collocation \"indispensable to,\" means an extremely important and necessary part of \"the country's economic growth.\" To convey that the importance of the process comes from its role in economic growth, the sentence should be changed to \"This process is seen as indispensable because it is part of the country's economic growth in the manufacturing sector.\""
            },
            {
                "start": 13,
                "end": 14,
                "error": "economical",
                "correct": "economic",
                "explanation": "\"Economical\" refers to the careful use of money or resources, or to a product that is not expensive. \"Economic\" means relating to the economy, which is the intended meaning here. "
            }
        ],
        "id": 789,
        "incorrect sentence": "This process has always been seen indispensable as part of the country 's economical growth in the manufacturing sector .",
        "correct sentence": "This process has always been seen as indispensable to the country 's economic growth in the manufacturing sector ."
    },
    {
        "corrections": [
            {
                "start": 24,
                "end": 25,
                "error": "preventing",
                "correct": "prevent",
                "explanation": "First, the phrase \"factors that preventing\" is not grammatically correct. The present continuous tense \"[to be] + [verb]-ing\" always requires a form of the verb \"to be,\" which is absent here. The correct wording is \"factors that are preventing.\" However, the present continuous tense indicates that an action is currently in progress, implying that it has starting and ending points. The present tense indicates a state that is currently or often true, so a better choice is the present tense \"prevent,\" which agrees with the plural \"factors.\""
            }
        ],
        "id": 793,
        "incorrect sentence": "As we understand the relevance and importance of engineering design , we will come to realize that in reality there are several factors that preventing the progress of engineering design .",
        "correct sentence": "As we understand the relevance and importance of engineering design , we will come to realize that in reality there are several factors that prevent the progress of engineering design ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 5,
                "error": "process",
                "correct": "processes",
                "explanation": "The sentence is referring to one process: engineering design. Because the subject is singular, it is grammatically incorrect to use the plural \"processes.\""
            },
            {
                "start": 5,
                "end": 8,
                "error": "has come to",
                "correct": "-",
                "explanation": "I don't necessarily agree with this correction. The phrase \"has come to incur\" is grammatically correct, and it refers to a condition that arose at some time in the past but did not always exist. In the next sentence, the phrase \"significantly more costly compared to... in previous years\" elaborates on this phrase, and it can clarify the argument to introduce the idea here first."
            }
        ],
        "id": 797,
        "incorrect sentence": "Firstly , engineering design process has come to incur excessive costs .",
        "correct sentence": "Firstly , engineering design processes incur excessive costs ."
    },
    {
        "corrections": [
            {
                "start": 10,
                "end": 10,
                "error": "-",
                "correct": "today",
                "explanation": "The phrase \"more costly compared to previous years\" implies a comparison against another period of time, but no other period of time has been mentioned. Therefore, \"today\" should be added to address this lack of information."
            },
            {
                "start": 12,
                "end": 13,
                "error": "way",
                "correct": "significantly",
                "explanation": "The word \"way\" can be used to modify a comparative adjective in casual speech, but is inappropriate in formal written English. The correct way to say \"way costlier\" in formal English is \"significantly more costly.\""
            },
            {
                "start": 13,
                "end": 14,
                "error": "costlier",
                "correct": "more costly",
                "explanation": "\"Costlier\" is not a word. The comparative of \"costly\" is \"more costly.\""
            },
            {
                "start": 16,
                "end": 16,
                "error": "-",
                "correct": "R & D costs in",
                "explanation": "I partially agree with this correction, because it fixes only one of the issues but causes another. First, the original sentence uses the incorrect verb form. The singular phrase \"research and development\" requires the verb \"has,\" not have. Second, as the correction rightly indicates, the preposition \"in\" is necessary in the phrase \"in previous years\" in order to compare R&D costs today with those of previous years. However, the correction is comparing two incomparable things: (1) \"research and development,\" which is a process, and (2) \"R&D costs,\" which are expenditures. The comparison should not be between a process and expenditures but current costs to past costs. Also, it is unusual and confusing to use both \"research and development\" and \"R&D\" within the same comparison. It is acceptable to use either phrase, but not to mix them. Finally, the correction states the subject of comparison \"R&D costs\" in both the first and second half of the comparison. Common practice is to state it in one part, not both, because repetition makes the sentence wordy and confusing. To fix all these issues without causing new ones, the correction should be \"As a result, R&D in these fields has become significantly more costly than in previous years.\" "
            }
        ],
        "id": 805,
        "incorrect sentence": "As a result , research and development in these fields have become way costlier compared to previous years .",
        "correct sentence": "As a result , research and development in these fields today have become significantly more costly compared to R & D costs in previous years ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "only",
                "correct": "-",
                "explanation": "This is a stylistic correction, not a grammatical issues. The word \"only\" conveys that there is an upper limit, but this meaning is already present in the phrase \"certain fixed amount.\" Therefore, \"only\" can be removed for brevity. It's also acceptable to leave the sentence as is to emphasize that the amount is limited."
            },
            {
                "start": 17,
                "end": 18,
                "error": "of",
                "correct": "to",
                "explanation": "The verb \"allocate\" means to divide and give out to certain parties for a specific reason. The preposition \"to\" is used with most words that mean give, as it indicates the person or thing that receives an object or action."
            }
        ],
        "id": 809,
        "incorrect sentence": "In Singapore , there is only a certain fixed amount in the country 's national budget allocated of the research and development sector .",
        "correct sentence": "In Singapore , there is a certain fixed amount in the country 's national budget allocated to the research and development sector ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 1,
                "error": "It",
                "correct": "Since it",
                "explanation": "This is a stylistic correction, not a grammatical one. There is no grammatical problem with the structure \"It is...; therefore,\" but the ideas are easier to understand as a single sentence. If combining two sentences like this, it is correct to say either \"Since it is more... , it is inevitable...\" or \"It is more... , so it is inevitable...\""
            },
            {
                "start": 9,
                "end": 11,
                "error": "; therefore",
                "correct": ",",
                "explanation": "\"Therefore\" means \"for that reason,\" and that idea is already conveyed by the use of \"since.\" This means \"therefore\" is redundant, so it should be deleted."
            },
            {
                "start": 15,
                "end": 15,
                "error": "-",
                "correct": "there would be",
                "explanation": "The conjunction \"that\" is used to introduce a clause that explains the meaning of the pronoun \"it,\" as in \"it is inevitable.\" This means that \"it\" is substituted for \"that,\" and that the clause that comes after will explain what is inevitable. However, the phrase \"a slight reluctance...\" needs a verb or verb phrase to connect it to \"it is inevitable that\" because it is a noun phrase that cannot directly follow either \"it\" or \"that.\" The best choice is \"there would be,\" which refers either to future events from the perspective of the past, or to something that may or may not occur."
            },
            {
                "start": 25,
                "end": 26,
                "error": "by",
                "correct": "on the part of",
                "explanation": "The preposition here needs to connect \"reluctance\" and government. The preposition \"by\" can indicate an action performed by an agent, but \"reluctance\" is a state or a feeling, not an action. Therefore, \"by\" should be changed to \"on the part of,\" which can be used for actions and states alike. "
            },
            {
                "start": 29,
                "end": 29,
                "error": "-",
                "correct": "hence ,",
                "explanation": "In the original sentence, two complete sentences are linked by a semicolon, but there is nothing to indicate what the relationship between the sentences is. Because they have a causal relationship, it needs the adverb \"hence,\" meaning \"for this reason.\""
            },
            {
                "start": 30,
                "end": 33,
                "error": "reality of the",
                "correct": "actual",
                "explanation": "The subject of the clause is \"the reality of the support,\" and the verb is \"is.\" The original sentence means \"the reality is weak,\" but the weak thing should be the support, not the reality. A better way to express this idea is the phrase \"the actual support.\""
            }
        ],
        "id": 817,
        "incorrect sentence": "It is more expensive to conduct creative engineering research ; therefore it is inevitable that a slight reluctance in contributing more assets to engineering design by the government ; the reality of the support given by the government is weak .",
        "correct sentence": "Since it is more expensive to conduct creative engineering research , it is inevitable that there would be a slight reluctance in contributing more assets to engineering design on the part of the government ; hence , the actual support given by the government is weak ."
    },
    {
        "corrections": [
            {
                "start": 4,
                "end": 6,
                "error": "has also",
                "correct": "also has",
                "explanation": "The adverb \"also\" comes before a verb to emphasize that the action is an additional action. The exception is the verb \"to be,\" in which case it comes after. The verb is \"has,\" so \"also\" should come before it."
            },
            {
                "start": 7,
                "end": 9,
                "error": "financial plans",
                "correct": "areas",
                "explanation": "The phrase \"other financial plans in spending their resources\" is wordy and confusing. First, the phrase \"financial plan\" refers to an individual's financial goals/strategy, not a government-level budget. This sentence is referring to a fixed budget in which a limited amount of resources are allocated among different areas, not other plans. Therefore, the phrase \"other areas to spend their resources on\" expresses this idea more clearly."
            },
            {
                "start": 9,
                "end": 11,
                "error": "in spending",
                "correct": "to spend",
                "explanation": "The phrase \"has other areas in spending\" does not mean anything. If the intended meaning is other things or areas where the government would rather use the money, it's clearer to say \"other areas to spend their resources on.\""
            },
            {
                "start": 13,
                "end": 13,
                "error": "-",
                "correct": "on",
                "explanation": "The phrase \"spend on\" is a phrasal verb. The preposition never varies."
            }
        ],
        "id": 823,
        "incorrect sentence": "Moreover , the government has also other financial plans in spending their resources .",
        "correct sentence": "Moreover , the government also has other areas to spend their resources on ."
    },
    {
        "corrections": [
            {
                "start": 6,
                "end": 7,
                "error": "economical",
                "correct": "economic",
                "explanation": "\"Economical\" refers to the careful use of money or resources, or to a product that is not expensive. \"Economic\" means relating to the economy, which is the intended meaning here. "
            },
            {
                "start": 13,
                "end": 14,
                "error": "splurge",
                "correct": "spend",
                "explanation": "The verb \"splurge\" means to spend more money than usual, typically on something indulgent. This does not make sense in the context of using money wisely. It's better to use the more general verb \"spend,\" which simply means to use money to pay for something. "
            },
            {
                "start": 25,
                "end": 26,
                "error": "instill",
                "correct": "encourage",
                "explanation": "The verb \"instill\" means to gradually encourage an attitude or feeling in a person or population. A better word choice is \"encourage,\" which means to make something more likely to happen or make someone more likely to do something. If the government provides incentives, it is in order to make people more likely to participate in entrepreneurship, not to make them feel a certain way about entrepreneurship."
            }
        ],
        "id": 828,
        "incorrect sentence": "Some feel that in these tough economical times , it is wiser to splurge the money on restructuring the economy or providing more incentives to instill entrepreneurship , rather than investing in research in engineering design .",
        "correct sentence": "Some feel that in these tough economic times , it is wiser to spend the money on restructuring the economy or providing more incentives to encourage entrepreneurship , rather than investing in research in engineering design ."
    },
    {
        "corrections": [
            {
                "start": 14,
                "end": 15,
                "error": "in",
                "correct": "to",
                "explanation": "The phrase \"in full swing\" is an idiom and always uses the preposition \"in.\""
            }
        ],
        "id": 831,
        "incorrect sentence": "Hence , the area of innovative research and development in engineering is not driven in full swing .",
        "correct sentence": "Hence , the area of innovative research and development in engineering is not driven to full swing ."
    },
    {
        "corrections": [
            {
                "start": 3,
                "end": 4,
                "error": "amount",
                "correct": "number",
                "explanation": "\"Amount\" is used for things that cannot be counted, while \"number\" is used for things that can be counted. Because \"people\" can be counted, it should be changed to \"number.\""
            }
        ],
        "id": 834,
        "incorrect sentence": "Secondly , the amount of creative people in Singapore is small , which may be a major reason for the hampering of innovative engineering design .",
        "correct sentence": "Secondly , the number of creative people in Singapore is small , which may be a major reason for the hampering of innovative engineering design ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 6,
                "error": "scarce",
                "correct": "small",
                "explanation": "\"Scarce\" is not commonly used to describe a population. It's common to say \"small\" instead. "
            }
        ],
        "id": 837,
        "incorrect sentence": "The population of Singapore is scarce compared to other countries in the region .",
        "correct sentence": "The population of Singapore is small compared to other countries in the region ."
    },
    {
        "corrections": [
            {
                "start": 7,
                "end": 8,
                "error": "their",
                "correct": "the",
                "explanation": "The phrase \"their population\" implies one shared population because of the use of the singular \"population.\" However, substituting \"populations\" will not fix the issue because the possessive pronoun for countries is \"its,\" not \"their.\" Substituting \"it\" will not fix the issue either because the singular \"its population\" refers to the population of one country, and the plural \"its populations\" is grammatically incorrect because the singular \"its\" cannot be used with a plural. Therefore, the best way to phrase this is \"the population.\""
            },
            {
                "start": 9,
                "end": 10,
                "error": "amount",
                "correct": "numbers",
                "explanation": "Both \"amount to\" and \"numbers in\" refer to a total amount, but \"amount to\" emphasizes the nuance of adding up or adding things together. It might be used to refer to population in the context of census-taking, but not in a general context like this."
            },
            {
                "start": 10,
                "end": 11,
                "error": "to",
                "correct": "in",
                "explanation": "The phrase \"numbers in the X\" is an idiomatic expression referring to a range of numbers. With \"in the billions,\" it means multiple billions but less than one trillion. It always uses the preposition \"in.\""
            },
            {
                "start": 11,
                "end": 11,
                "error": "-",
                "correct": "the",
                "explanation": "The phrase \"numbers in the X\" is an idiomatic expression referring to a range of numbers. With \"in the billions,\" it means multiple billions but less than one trillion. It always uses the preposition \"in.\""
            }
        ],
        "id": 843,
        "incorrect sentence": "In countries like China and India , their population amount to billions whereas the population of Singapore is only 4.5 million .",
        "correct sentence": "In countries like China and India , the population numbers in the billions whereas the population of Singapore is only 4.5 million ."
    },
    {
        "corrections": [
            {
                "start": 13,
                "end": 14,
                "error": "lesser",
                "correct": "less",
                "explanation": "The adjective \"lesser\" means smaller in size and quality, while \"less\" is used to compare the quantity or degree of something. The subject here is \"five percent,\" which is a number/quantity, so \"lesser\" should be changed to \"less.\""
            },
            {
                "start": 21,
                "end": 22,
                "error": "the",
                "correct": "-",
                "explanation": "China is a proper noun, and most proper nouns do not take the definite article \"the.\" This is because the function of \"the\" is to indicate that a noun is one specific thing, which is unnecessary with proper nouns because they are specific by nature."
            }
        ],
        "id": 848,
        "incorrect sentence": "For example , five percent of the population in Singapore is 1000 times lesser than five percent of the population in the China .",
        "correct sentence": "For example , five percent of the population in Singapore is 1000 times less than five percent of the population in China ."
    },
    {
        "corrections": [
            {
                "start": 16,
                "end": 17,
                "error": "economical",
                "correct": "economic",
                "explanation": "\"Economical\" refers to the careful use of money or resources, or to a product that is not expensive. \"Economic\" means relating to the economy, which is the intended meaning here. "
            },
            {
                "start": 18,
                "end": 22,
                "error": "due to engineering design",
                "correct": "-",
                "explanation": "The phrase \"success due to engineering design\" means \"success because of engineering design.\" The idea of success being related to engineering design is already present in \"driven engineering design projects,\" so the phrase is redundant and should be deleted."
            }
        ],
        "id": 853,
        "incorrect sentence": "Although there are many Singaporean-based driven engineering design projects like NEWater plants , much of our economical success due to engineering design is highly dependent on other countries .",
        "correct sentence": "Although there are many Singaporean-based driven engineering design projects like NEWater plants , much of our economic success is highly dependent on other countries ."
    },
    {
        "corrections": [
            {
                "start": 12,
                "end": 12,
                "error": "-",
                "correct": "from",
                "explanation": "Without the preposition \"from,\" the verb \"bought\" simply means purchased, without specifying where they are purchased from. The preposition \"from,\" which indicates a source, conveys that the products come from Japan."
            },
            {
                "start": 15,
                "end": 16,
                "error": "from",
                "correct": "of",
                "explanation": "The preposition \"from\" indicates a source, so it means that the replicas come from models in Japan, as if they were distributed by or emitted from these models. Replicas are referred to with \"of,\" which indicates what something is made from or includes."
            },
            {
                "start": 16,
                "end": 17,
                "error": "the",
                "correct": "-",
                "explanation": "The concept of \"models\" is a general concept and can be assumed to be understood by the reader. It takes the definite article only when referring to specific groups of models instead of to models in general."
            }
        ],
        "id": 859,
        "incorrect sentence": "In areas of mechanical engineering , our latest machineries are either bought or are replicas from the models in Japan .",
        "correct sentence": "In areas of mechanical engineering , our latest machineries are either bought from or are replicas of models in Japan ."
    },
    {
        "corrections": [
            {
                "start": 2,
                "end": 3,
                "error": "on",
                "correct": "of",
                "explanation": "The phrase \"impact on\" refers to the object of the impact or where the impact is felt, as in the example \"Bird flu has an impact on egg prices.\" The phrase \"having a limited number of creative people\" is not the object of the impact. Instead, it is the reason for the impact. Therefore, \"of\" should be used because it can indicate the reason for something."
            },
            {
                "start": 6,
                "end": 7,
                "error": "amount",
                "correct": "number",
                "explanation": "\"Amount\" is used for things that cannot be counted, while \"number\" is used for things that can be counted. Because \"people\" can be counted, it should be changed to \"number.\""
            }
        ],
        "id": 863,
        "incorrect sentence": "The impact on having a limited amount of creative people has resulted in Singapore having to resort to buying foreign-based engineering design equipment from overseas .",
        "correct sentence": "The impact of having a limited number of creative people has resulted in Singapore having to resort to buying foreign-based engineering design equipment from overseas ."
    },
    {
        "corrections": [
            {
                "start": 26,
                "end": 27,
                "error": "problem",
                "correct": "-",
                "explanation": "The word \"problems\" is already used in the phrase \"there are still problems like,\" so the second use of \"problems\" is redundant and should be deleted."
            }
        ],
        "id": 866,
        "incorrect sentence": "In conclusion , even though we realize the importance of engineering design processes in innovation , there are still problems like rising costs and population scarcity problem that hinders the progress of the engineering process .",
        "correct sentence": "In conclusion , even though we realize the importance of engineering design processes in innovation , there are still problems like rising costs and population scarcity that hinders the progress of the engineering process ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 11,
                "error": "a discovery under an accidental case",
                "correct": "the phenomenon of making an unintentional discovery",
                "explanation": "I agree with this correction partially. There is no issue with either \"accidental\" or \"unintentional\" so that edit is a stylistic one. As for the rest, firstly, the structure \"under an accidental case\" is not commonly used. A clearer way of describing such a discovery is \"making an accidental discovery.\" Secondly, the phrase \"Serendipity is usually defined as making an accidental discovery\" is grammatically correct, but that doesn't sound like a definition. Phrases like \"a phenomenon of\" are frequently used to make definitions match the part of speech of the word being defined. Since \"serendipity\" is a noun, its definition is easier to understand if it begins with a noun, like \"phenomenon,\" instead of a gerund like \"making.\""
            },
            {
                "start": 16,
                "end": 16,
                "error": "-",
                "correct": "in",
                "explanation": "The verb \"result\" needs the preposition \"in\" to indicate the outcome or result of the action."
            }
        ],
        "id": 870,
        "incorrect sentence": "Serendipity is usually defined as a discovery under an accidental case , and it often results the invention of a new technology .",
        "correct sentence": "Serendipity is usually defined as the phenomenon of making an unintentional discovery , and it often results in the invention of a new technology ."
    },
    {
        "corrections": [
            {
                "start": 0,
                "end": 7,
                "error": "Serendipity-based technology has some similarities and differences",
                "correct": "There are some similarities and differences between serendipity-based technology",
                "explanation": "The structure \"X has similarities and differences with Y\" is not commonly used in English, and is difficult to understand. The commonly used structure is \"There are some similarities and differences between X and Y.\" This structure is clearer because the two objects of comparison are next to each other, linked with \"and.\""
            },
            {
                "start": 7,
                "end": 8,
                "error": "with",
                "correct": "and",
                "explanation": "The preposition \"with\" is often used with \"similarities\" but not with \"differences.\" This is because \"with\" expresses accordance or similarity, so it is inappropriate to use it with \"differences.\" Therefore, it's better to say \"There are similarities and differences between A and B,\" with the preposition \"and\" serving to link \"A\" and \"B\" together."
            },
            {
                "start": 12,
                "end": 16,
                "error": ", for example :",
                "correct": "such as",
                "explanation": "The phrase \"for example\" is used to introduce non-exhaustive lists. Here, the sentence provides a specific example (\"the technology used in a refrigerator\"), so it should use \"such as,\" which is more appropriate when providing specific examples."
            },
            {
                "start": 18,
                "end": 19,
                "error": "of",
                "correct": "used in a",
                "explanation": "First, \"refrigerator\" is a noun that requires an article or pluralization. The definite article \"the\" is not appropriate because it means one specific refrigerator. The indefinite article \"a\" is appropriate because it means one unspecified thing of many possibilities, so it can refer to any refrigerator, without specifying the owner, brand, etc. The plural \"refrigerators\" would also be appropriate in a general statement like this because it means all or most refrigerators. Second, a refrigerator is considered an appliance or device, not a technology, so the phrase \"the technology of a refrigerator\" doesn't make sense. It's clearer to say \"the technology used in a refrigerator.\""
            }
        ],
        "id": 877,
        "incorrect sentence": "Serendipity-based technology has some similarities and differences with technology developed through research , for example : the technology of refrigerator .",
        "correct sentence": "There are some similarities and differences between serendipity-based technology and technology developed through research such as the technology used in a refrigerator ."
    },
    {
        "corrections": [
            {
                "start": 5,
                "end": 8,
                "error": "have demands on",
                "correct": "demand",
                "explanation": "The phrase \"have demands on\" is not commonly used. Instead, it would be \"have demand for,\" as the preposition \"for\" can either mean in order to get something or indicate the thing toward which feelings are directed. However, it is most common to simply say \"demand.\" This is also shorter and clearer, so extra words should be deleted to avoid wordiness and potential confusion."
            },
            {
                "start": 11,
                "end": 14,
                "error": "usually they will",
                "correct": "they will usually",
                "explanation": "The adverb \"usually\" can come before a verb or at the start of a sentence. Here, it should be between the modal verb \"will\" and the verb \"try\" so that it modifies the phrase \"try to solve the problems.\""
            }
        ],
        "id": 882,
        "incorrect sentence": "When people encounter problems or have demands on certain things , usually they will try to solve the problems through research and development .",
        "correct sentence": "When people encounter problems or demand certain things , they will usually try to solve the problems through research and development ."
    }
]